toolchain/ocamlbuild.org

OCamlbuild

* Intorduction 
  The reason for =ocamlbuild= in OCaml is to solve the complex scheme
  to when building with the preprocessor =camlp4=. But it's very useful
  in other aspects as well.

  The building process is done in the =_build= directory. =ocamlbuild=
  copies the needed source files and compiles them.  In =_build=,
  =_log= file contains detailed building process. It's a good habit to
  refer =_log= file when you find something is wrong during the
  building process.

  =ocamlbuild= automatically creates a symbol link to the executable
  in the current directory.  There are built-in hygiene rules which
  means when start up, /.cmo, .cmi, or .o/ should not appear in the
  toplevel, outside of the /_build/. Sometimes when you want to mix
  c-stubs, you tag the /.o/ object file =precious= or =-no-hygiene=

