toolchain/ocamlbuild.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OCamlbuild</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="OCamlbuild"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-02 19:15:17 EDT"/>
<meta name="author" content="Hongbo Zhang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../css/style.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">OCamlbuild</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Intorduction</a>
<ul>
<li><a href="#sec-1-1">Options</a></li>
<li><a href="#sec-1-2">Tags</a></li>
<li><a href="#sec-1-3">Handle Multiple Directories</a></li>
<li><a href="#sec-1-4">Packing</a></li>
<li><a href="#sec-1-5">Grouping Targets</a></li>
<li><a href="#sec-1-6">Debugging</a></li>
<li><a href="#sec-1-7">Documentation</a></li>
<li><a href="#sec-1-8">Glob patterns</a></li>
<li><a href="#sec-1-9">Lex Yacc</a></li>
<li><a href="#sec-1-10">ocamlfind</a></li>
<li><a href="#sec-1-11">Preprocessing</a>
<ul>
<li><a href="#sec-1-11-1">Built in flags</a></li>
</ul>
</li>
<li><a href="#sec-1-12">Principles</a>
<ul>
<li><a href="#sec-1-12-1">Rules</a></li>
<li><a href="#sec-1-12-2">Customize plugin</a></li>
</ul>
</li>
<li><a href="#sec-1-13">Mixing with C stubs</a>
<ul>
<li><a href="#sec-1-13-1">Built in support</a></li>
</ul>
</li>
<li><a href="#sec-1-14">Building cmi files</a></li>
<li><a href="#sec-1-15">Debugging</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Intorduction</h2>
<div class="outline-text-2" id="text-1">

<p>  The reason for <code>ocamlbuild</code> in OCaml is to solve the complex scheme
  to when building with the preprocessor <code>camlp4</code>. But it's very useful
  in other aspects as well.
</p>
<p>
  The building process is done in the <code>_build</code> directory. <code>ocamlbuild</code>
  copies the needed source files and compiles them.  In <code>_build</code>,
  <code>_log</code> file contains detailed building process. It's a good habit to
  refer <code>_log</code> file when you find something is wrong during the
  building process.
</p>
<p>
  <code>ocamlbuild</code> automatically creates a symbol link to the executable
  in the current directory.  There are built-in hygiene rules which
  means when start up, <i>.cmo, .cmi, or .o</i> should not appear in the
  toplevel, outside of the <i>_build</i>. Sometimes when you want to mix
  c-stubs, you tag the <i>.o</i> object file <code>precious</code> or <code>-no-hygiene</code>
</p>

</div>
