toolchain/ocamlbuild.tex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\providecommand{\alert}[1]{\textbf{#1}}

\title{OCamlbuild}
%\author{Hongbo Zhang}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.03}}

\begin{document}

\maketitle




\section*{Intorduction}
\label{sec-1}

  The reason for \texttt{ocamlbuild} in OCaml is to solve the complex scheme
  to when building with the preprocessor \texttt{camlp4}. But it's very useful
  in other aspects as well.

  The building process is done in the \texttt{\_build} directory. \texttt{ocamlbuild}
  copies the needed source files and compiles them.  In \texttt{\_build},
  \texttt{\_log} file contains detailed building process. It's a good habit to
  refer \texttt{\_log} file when you find something is wrong during the
  building process.

  \texttt{ocamlbuild} automatically creates a symbol link to the executable
  in the current directory.  There are built-in hygiene rules which
  means when start up, \emph{.cmo, .cmi, or .o} should not appear in the
  toplevel, outside of the \emph{_build}. Sometimes when you want to mix
  c-stubs, you tag the \emph{.o} object file \texttt{precious} or \texttt{-no-hygiene}
