toolchain/ocamlbuild.org
** Options

   #+CAPTION: Ocamlbuild options
   #+LABEL: tbl:ob_option
   #+ATTR_HTML: border="2" 
   | Options                    | Comments                                                                    |
   |----------------------------+-----------------------------------------------------------------------------|
   | -version                   | Display the version                                                         |
   | -vnum                      | Display the version number                                                  |
   | -quiet                     | Make as quiet as possible                                                   |
   | -verbose <level>           | Set the verbosity level (1 for some common error message)                   |
   | -documentation             | Show rules and flags(works with =_tags= file)                               |
   | -log <file>                | Set log file                                                                |
   | -no-log                    | No log file                                                                 |
   | -clean                     | Remove build directory and other files, then exit                           |
   | -r                         | Traverse directories =by default= (false: traverse to turn off)             |
   |----------------------------+-----------------------------------------------------------------------------|
   | -I <path>                  | Add to include directories                                                  |
   | -Is <path,...>             | (same as above, but accepts a (comma or blank)-separated list)              |
   | -X <path>                  | Directory to =ignore=                                                       |
   | -Xs <path,...>             | (idem)                                                                      |
   | -lib <flag>                | Link to this ocaml library /.cma/                                           |
   | -libs <flag,...>           | (idem)                                                                      |
   | -mod <module>              | Link to this ocaml =module= /.cmo/                                          |
   | -mods <module,...>         | (idem)                                                                      |
   | -pkg <package>             | Link to this ocaml findlib package                                          |
   | -pkgs <package,...>        | (idem)                                                                      |
   | -package <package>         | (idem)                                                                      |
   | -lflag <flag>              | Add to ocamlc link flags                                                    |
   | -lflags <flag,...>         | (idem)                                                                      |
   | -cflag <flag>              | Add to ocamlc compile flags                                                 |
   | -cflags <flag,...>         | (idem)                                                                      |
   | -docflag <flag>            | Add to ocamldoc flags                                                       |
   | -docflags <flag,...>       | (idem)                                                                      |
   | -yaccflag <flag>           | Add to ocamlyacc flags (you can hack for =menhir=)                          |
   | -yaccflags <flag,...>      | (idem)                                                                      |
   | -lexflag <flag>            | Add to ocamllex flags                                                       |
   | -lexflags <flag,...>       | (idem)                                                                      |
   |----------------------------+-----------------------------------------------------------------------------|
   | -ppflag <flag>             | Add to ocaml preprocessing flags                                            |
   | -pp <flag,...>             | (idem)                                                                      |
   |----------------------------+-----------------------------------------------------------------------------|
   | -tag <tag>                 | Add to =default= tags                                                       |
   | -tags <tag,...>            | (idem)                                                                      |
   | -tag-line <tag>            | Use this line of tags (as in _tags)                                         |
   | -show-tags <path>          | Show tags that applies on that pathname                                     |
   |----------------------------+-----------------------------------------------------------------------------|
   | -ignore <module,...>       | Don't try to build these modules, workaround ocamldep bug                   |
   | -no-links                  | Don't make links of produced final targets                                  |
   | -no-skip                   | Don't skip modules that are requested by ocamldep but cannot be built       |
   | -no-hygiene                | Don't apply sanity-check rules                                              |
   | -no-plugin                 | Don't build myocamlbuild.ml                                                 |
   | -no-stdlib                 | Don't ignore stdlib modules                                                 |
   | -dont-catch-errors         | Don't catch and display exceptions =useful to display the call stack=       |
   |----------------------------+-----------------------------------------------------------------------------|
   | -just-plugin               | Just build myocamlbuild.ml                                                  |
   | -byte-plugin               | Don't use a native plugin but bytecode                                      |
   | -plugin-option             | Use the option only when plugin is run                                      |
   | -sanitization-script       | Change the file name for the generated sanitization script                  |
   | -no-sanitize               | Do not generate sanitization script                                         |
   | -nothing-should-be-rebuilt | Fail if something needs to be rebuilt                                       |
   | -classic-display           | Display executed commands the old-fashioned way                             |
   | -use-menhir                | Use menhir instead of ocamlyacc                                             |
   | -use-jocaml                | Use jocaml compilers instead of ocaml ones                                  |
   | -use-ocamlfind             | Use ocamlfind to call ocaml compilers                                       |
   | -j <N>                     | Allow N jobs at once (0 for unlimited)                                      |
   |----------------------------+-----------------------------------------------------------------------------|
   | -build-dir <path>          | Set build directory (implies no-links)                                      |
   | -install-lib-dir <path>    | Set the install library directory                                           |
   | -install-bin-dir <path>    | Set the install binary directory                                            |
   | -where                     | Display the install library directory                                       |
   | -ocamlc <command>          | Set the OCaml bytecode compiler                                             |
   | -ocamlopt <command>        | Set the OCaml native compiler                                               |
   | -ocamldep <command>        | Set the OCaml dependency tool                                               |
   | -ocamldoc <command>        | Set the OCaml documentation generator                                       |
   | -ocamlyacc <command>       | Set the ocamlyacc tool                                                      |
   | -menhir <command>          | Set the menhir tool (use it after -use-menhir)                              |
   | -ocamllex <command>        | Set the ocamllex tool                                                       |
   | -ocamlmktop <command>      | Set the ocamlmktop tool                                                     |
   | -ocamlrun <command>        | Set the ocamlrun tool                                                       |
   | --                         | Stop argument processing, remaining arguments are given to the user program |
   | -help                      | Display this list of options                                                |
   | --help                     | Display this list of options                                                |


   The snippet below is a very simple example
   #+BEGIN_SRC shell-script
     ocamlbuild -quiet xx.native -- args
     ocamlbuild -quiet -use-ocamlfind xx.native -- args
   #+END_SRC

   You can pass flags to =ocamlc=| at compile time. i.e, /-cflags
   -I,+lablgtk,-rectypes/

   You can link with /external/ libraries(/.cma/). i.e, /-libs
   unix,num/.  You may need additional options below to make it work
   if this not in OCaml's default search path, /-cflags
   -I,/usr/local/lib/ocaml/, /-lflags -I,/usr/local/lib/ocaml/


   You can also build a library with specicfic modules included using
   /mllib/ file

   #+BEGIN_SRC shell-script
     cat top_level.mllib    
     Dir_top_level_util
     Dir_top_level  
   #+END_SRC
   
   Then you can =ocamlbuild top_level.cma=, then you can use
   =ocamlobjinfo= to see exactly which modules are linked into it.

   #+BEGIN_SRC shell-script
     ocamlobjinfo _build/top_level.cma | grep Unit  
     Unit name: Dir_top_level_util
     Unit name: Dir_top_level
   #+END_SRC

