toolchain/ocamlbuild.html

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Options</h3>
<div class="outline-text-3" id="text-1-1">


<table   border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="tbl-ob_option">
<caption>Ocamlbuild options</caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Options</th><th scope="col" class="left">Comments</th></tr>
</thead>
<tbody>
<tr><td class="left">-version</td><td class="left">Display the version</td></tr>
<tr><td class="left">-vnum</td><td class="left">Display the version number</td></tr>
<tr><td class="left">-quiet</td><td class="left">Make as quiet as possible</td></tr>
<tr><td class="left">-verbose &lt;level&gt;</td><td class="left">Set the verbosity level (1 for some common error message)</td></tr>
<tr><td class="left">-documentation</td><td class="left">Show rules and flags(works with <code>_tags</code> file)</td></tr>
<tr><td class="left">-log &lt;file&gt;</td><td class="left">Set log file</td></tr>
<tr><td class="left">-no-log</td><td class="left">No log file</td></tr>
<tr><td class="left">-clean</td><td class="left">Remove build directory and other files, then exit</td></tr>
<tr><td class="left">-r</td><td class="left">Traverse directories <code>by default</code> (false: traverse to turn off)</td></tr>
</tbody>
<tbody>
<tr><td class="left">-I &lt;path&gt;</td><td class="left">Add to include directories</td></tr>
<tr><td class="left">-Is &lt;path,&hellip;&gt;</td><td class="left">(same as above, but accepts a (comma or blank)-separated list)</td></tr>
<tr><td class="left">-X &lt;path&gt;</td><td class="left">Directory to <code>ignore</code></td></tr>
<tr><td class="left">-Xs &lt;path,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-lib &lt;flag&gt;</td><td class="left">Link to this ocaml library <i>.cma</i></td></tr>
<tr><td class="left">-libs &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-mod &lt;module&gt;</td><td class="left">Link to this ocaml <code>module</code> <i>.cmo</i></td></tr>
<tr><td class="left">-mods &lt;module,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-pkg &lt;package&gt;</td><td class="left">Link to this ocaml findlib package</td></tr>
<tr><td class="left">-pkgs &lt;package,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-package &lt;package&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-lflag &lt;flag&gt;</td><td class="left">Add to ocamlc link flags</td></tr>
<tr><td class="left">-lflags &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-cflag &lt;flag&gt;</td><td class="left">Add to ocamlc compile flags</td></tr>
<tr><td class="left">-cflags &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-docflag &lt;flag&gt;</td><td class="left">Add to ocamldoc flags</td></tr>
<tr><td class="left">-docflags &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-yaccflag &lt;flag&gt;</td><td class="left">Add to ocamlyacc flags (you can hack for <code>menhir</code>)</td></tr>
<tr><td class="left">-yaccflags &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-lexflag &lt;flag&gt;</td><td class="left">Add to ocamllex flags</td></tr>
<tr><td class="left">-lexflags &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
</tbody>
<tbody>
<tr><td class="left">-ppflag &lt;flag&gt;</td><td class="left">Add to ocaml preprocessing flags</td></tr>
<tr><td class="left">-pp &lt;flag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
</tbody>
<tbody>
<tr><td class="left">-tag &lt;tag&gt;</td><td class="left">Add to <code>default</code> tags</td></tr>
<tr><td class="left">-tags &lt;tag,&hellip;&gt;</td><td class="left">(idem)</td></tr>
<tr><td class="left">-tag-line &lt;tag&gt;</td><td class="left">Use this line of tags (as in _tags)</td></tr>
<tr><td class="left">-show-tags &lt;path&gt;</td><td class="left">Show tags that applies on that pathname</td></tr>
</tbody>
<tbody>
<tr><td class="left">-ignore &lt;module,&hellip;&gt;</td><td class="left">Don't try to build these modules, workaround ocamldep bug</td></tr>
<tr><td class="left">-no-links</td><td class="left">Don't make links of produced final targets</td></tr>
<tr><td class="left">-no-skip</td><td class="left">Don't skip modules that are requested by ocamldep but cannot be built</td></tr>
<tr><td class="left">-no-hygiene</td><td class="left">Don't apply sanity-check rules</td></tr>
<tr><td class="left">-no-plugin</td><td class="left">Don't build myocamlbuild.ml</td></tr>
<tr><td class="left">-no-stdlib</td><td class="left">Don't ignore stdlib modules</td></tr>
<tr><td class="left">-dont-catch-errors</td><td class="left">Don't catch and display exceptions <code>useful to display the call stack</code></td></tr>
</tbody>
<tbody>
<tr><td class="left">-just-plugin</td><td class="left">Just build myocamlbuild.ml</td></tr>
<tr><td class="left">-byte-plugin</td><td class="left">Don't use a native plugin but bytecode</td></tr>
<tr><td class="left">-plugin-option</td><td class="left">Use the option only when plugin is run</td></tr>
<tr><td class="left">-sanitization-script</td><td class="left">Change the file name for the generated sanitization script</td></tr>
<tr><td class="left">-no-sanitize</td><td class="left">Do not generate sanitization script</td></tr>
<tr><td class="left">-nothing-should-be-rebuilt</td><td class="left">Fail if something needs to be rebuilt</td></tr>
<tr><td class="left">-classic-display</td><td class="left">Display executed commands the old-fashioned way</td></tr>
<tr><td class="left">-use-menhir</td><td class="left">Use menhir instead of ocamlyacc</td></tr>
<tr><td class="left">-use-jocaml</td><td class="left">Use jocaml compilers instead of ocaml ones</td></tr>
<tr><td class="left">-use-ocamlfind</td><td class="left">Use ocamlfind to call ocaml compilers</td></tr>
<tr><td class="left">-j &lt;N&gt;</td><td class="left">Allow N jobs at once (0 for unlimited)</td></tr>
</tbody>
<tbody>
<tr><td class="left">-build-dir &lt;path&gt;</td><td class="left">Set build directory (implies no-links)</td></tr>
<tr><td class="left">-install-lib-dir &lt;path&gt;</td><td class="left">Set the install library directory</td></tr>
<tr><td class="left">-install-bin-dir &lt;path&gt;</td><td class="left">Set the install binary directory</td></tr>
<tr><td class="left">-where</td><td class="left">Display the install library directory</td></tr>
<tr><td class="left">-ocamlc &lt;command&gt;</td><td class="left">Set the OCaml bytecode compiler</td></tr>
<tr><td class="left">-ocamlopt &lt;command&gt;</td><td class="left">Set the OCaml native compiler</td></tr>
<tr><td class="left">-ocamldep &lt;command&gt;</td><td class="left">Set the OCaml dependency tool</td></tr>
<tr><td class="left">-ocamldoc &lt;command&gt;</td><td class="left">Set the OCaml documentation generator</td></tr>
<tr><td class="left">-ocamlyacc &lt;command&gt;</td><td class="left">Set the ocamlyacc tool</td></tr>
<tr><td class="left">-menhir &lt;command&gt;</td><td class="left">Set the menhir tool (use it after -use-menhir)</td></tr>
<tr><td class="left">-ocamllex &lt;command&gt;</td><td class="left">Set the ocamllex tool</td></tr>
<tr><td class="left">-ocamlmktop &lt;command&gt;</td><td class="left">Set the ocamlmktop tool</td></tr>
<tr><td class="left">-ocamlrun &lt;command&gt;</td><td class="left">Set the ocamlrun tool</td></tr>
<tr><td class="left">&ndash;</td><td class="left">Stop argument processing, remaining arguments are given to the user program</td></tr>
<tr><td class="left">-help</td><td class="left">Display this list of options</td></tr>
<tr><td class="left">&ndash;help</td><td class="left">Display this list of options</td></tr>
</tbody>
</table>



<p>
   The snippet below is a very simple example
</p>


<pre class="src src-shell-script">ocamlbuild -quiet xx.native -- args
ocamlbuild -quiet -use-ocamlfind xx.native -- args
</pre>


<p>
   You can pass flags to =ocamlc=| at compile time. i.e, <i>-cflags    -I,+lablgtk,-rectypes</i>
</p>
<p>
   You can link with <i>external</i> libraries(<i>.cma</i>). i.e, <i>-libs    unix,num</i>.  You may need additional options below to make it work
   if this not in OCaml's default search path, <i>-cflags    -I,/usr/local/lib/ocaml</i>, <i>-lflags -I,/usr/local/lib/ocaml</i>
</p>

<p>
   You can also build a library with specicfic modules included using
   <i>mllib</i> file
</p>



<pre class="src src-shell-script">cat top_level.mllib    
Dir_top_level_util
Dir_top_level  
</pre>


<p>   
   Then you can <code>ocamlbuild top_level.cma</code>, then you can use
   <code>ocamlobjinfo</code> to see exactly which modules are linked into it.
</p>



<pre class="src src-shell-script">ocamlobjinfo _build/top_level.cma | grep Unit  
Unit name: Dir_top_level_util
Unit name: Dir_top_level
</pre>


</div>

</div>
