toolchain/ocamlbuild.tex
\subsection*{Options}
\label{sec-1-1}


\begin{table}[htb]
\caption{Ocamlbuild options} \label{tbl:ob_option}
\begin{center}
\begin{tabular}{ll}
 Options                     &  Comments                                                                      \\
\hline
 -version                    &  Display the version                                                           \\
 -vnum                       &  Display the version number                                                    \\
 -quiet                      &  Make as quiet as possible                                                     \\
 -verbose <level>            &  Set the verbosity level (1 for some common error message)                     \\
 -documentation              &  Show rules and flags(works with \texttt{\_tags} file)                         \\
 -log <file>                 &  Set log file                                                                  \\
 -no-log                     &  No log file                                                                   \\
 -clean                      &  Remove build directory and other files, then exit                             \\
 -r                          &  Traverse directories \texttt{by default} (false: traverse to turn off)        \\
\hline
 -I <path>                   &  Add to include directories                                                    \\
 -Is <path,\ldots{}>         &  (same as above, but accepts a (comma or blank)-separated list)                \\
 -X <path>                   &  Directory to \texttt{ignore}                                                  \\
 -Xs <path,\ldots{}>         &  (idem)                                                                        \\
 -lib <flag>                 &  Link to this ocaml library \emph{.cma}                                        \\
 -libs <flag,\ldots{}>       &  (idem)                                                                        \\
 -mod <module>               &  Link to this ocaml \texttt{module} \emph{.cmo}                                \\
 -mods <module,\ldots{}>     &  (idem)                                                                        \\
 -pkg <package>              &  Link to this ocaml findlib package                                            \\
 -pkgs <package,\ldots{}>    &  (idem)                                                                        \\
 -package <package>          &  (idem)                                                                        \\
 -lflag <flag>               &  Add to ocamlc link flags                                                      \\
 -lflags <flag,\ldots{}>     &  (idem)                                                                        \\
 -cflag <flag>               &  Add to ocamlc compile flags                                                   \\
 -cflags <flag,\ldots{}>     &  (idem)                                                                        \\
 -docflag <flag>             &  Add to ocamldoc flags                                                         \\
 -docflags <flag,\ldots{}>   &  (idem)                                                                        \\
 -yaccflag <flag>            &  Add to ocamlyacc flags (you can hack for \texttt{menhir})                     \\
 -yaccflags <flag,\ldots{}>  &  (idem)                                                                        \\
 -lexflag <flag>             &  Add to ocamllex flags                                                         \\
 -lexflags <flag,\ldots{}>   &  (idem)                                                                        \\
\hline
 -ppflag <flag>              &  Add to ocaml preprocessing flags                                              \\
 -pp <flag,\ldots{}>         &  (idem)                                                                        \\
\hline
 -tag <tag>                  &  Add to \texttt{default} tags                                                  \\
 -tags <tag,\ldots{}>        &  (idem)                                                                        \\
 -tag-line <tag>             &  Use this line of tags (as in \_{}tags)                                        \\
 -show-tags <path>           &  Show tags that applies on that pathname                                       \\
\hline
 -ignore <module,\ldots{}>   &  Don't try to build these modules, workaround ocamldep bug                     \\
 -no-links                   &  Don't make links of produced final targets                                    \\
 -no-skip                    &  Don't skip modules that are requested by ocamldep but cannot be built         \\
 -no-hygiene                 &  Don't apply sanity-check rules                                                \\
 -no-plugin                  &  Don't build myocamlbuild.ml                                                   \\
 -no-stdlib                  &  Don't ignore stdlib modules                                                   \\
 -dont-catch-errors          &  Don't catch and display exceptions \texttt{useful to display the call stack}  \\
\hline
 -just-plugin                &  Just build myocamlbuild.ml                                                    \\
 -byte-plugin                &  Don't use a native plugin but bytecode                                        \\
 -plugin-option              &  Use the option only when plugin is run                                        \\
 -sanitization-script        &  Change the file name for the generated sanitization script                    \\
 -no-sanitize                &  Do not generate sanitization script                                           \\
 -nothing-should-be-rebuilt  &  Fail if something needs to be rebuilt                                         \\
 -classic-display            &  Display executed commands the old-fashioned way                               \\
 -use-menhir                 &  Use menhir instead of ocamlyacc                                               \\
 -use-jocaml                 &  Use jocaml compilers instead of ocaml ones                                    \\
 -use-ocamlfind              &  Use ocamlfind to call ocaml compilers                                         \\
 -j <N>                      &  Allow N jobs at once (0 for unlimited)                                        \\
\hline
 -build-dir <path>           &  Set build directory (implies no-links)                                        \\
 -install-lib-dir <path>     &  Set the install library directory                                             \\
 -install-bin-dir <path>     &  Set the install binary directory                                              \\
 -where                      &  Display the install library directory                                         \\
 -ocamlc <command>           &  Set the OCaml bytecode compiler                                               \\
 -ocamlopt <command>         &  Set the OCaml native compiler                                                 \\
 -ocamldep <command>         &  Set the OCaml dependency tool                                                 \\
 -ocamldoc <command>         &  Set the OCaml documentation generator                                         \\
 -ocamlyacc <command>        &  Set the ocamlyacc tool                                                        \\
 -menhir <command>           &  Set the menhir tool (use it after -use-menhir)                                \\
 -ocamllex <command>         &  Set the ocamllex tool                                                         \\
 -ocamlmktop <command>       &  Set the ocamlmktop tool                                                       \\
 -ocamlrun <command>         &  Set the ocamlrun tool                                                         \\
 --                          &  Stop argument processing, remaining arguments are given to the user program   \\
 -help                       &  Display this list of options                                                  \\
 --help                      &  Display this list of options                                                  \\
\end{tabular}
\end{center}
\end{table}



   The snippet below is a very simple example

\begin{minted}[]{bash}
ocamlbuild -quiet xx.native -- args
ocamlbuild -quiet -use-ocamlfind xx.native -- args
\end{minted}

   You can pass flags to =ocamlc=| at compile time. i.e, \emph{-cflags    -I,+lablgtk,-rectypes}

   You can link with \emph{external} libraries(\emph{.cma}). i.e, \emph{-libs    unix,num}.  You may need additional options below to make it work
   if this not in OCaml's default search path, \emph{-cflags    -I,/usr/local/lib/ocaml}, \emph{-lflags -I,/usr/local/lib/ocaml}


   You can also build a library with specicfic modules included using
   \emph{mllib} file


\begin{minted}[]{bash}
cat top_level.mllib    
Dir_top_level_util
Dir_top_level
\end{minted}
   
   Then you can \texttt{ocamlbuild top\_level.cma}, then you can use
   \texttt{ocamlobjinfo} to see exactly which modules are linked into it.


\begin{minted}[]{bash}
ocamlobjinfo _build/top_level.cma | grep Unit  
Unit name: Dir_top_level_util
Unit name: Dir_top_level
\end{minted}
