toolchain/ocamlbuild.org
** Tags
   You can alo use =mlpack= file to do hierachical packing =_tags=
   file is for convenience.  Every source tree may have a =_tags=
   file, and each target may have a set of tags.



   You can digest the output below to get a general idea of how tags
   file work.  By preceding a tag with /a minus sign/, one can
   =remove= tags from one or more files.

   #+BEGIN_SRC shell-script
     $ocamlbuild -show-tags test.ml
     
     Tags for "test.ml":
       {. extension:ml, file:test.ml, ocaml, pkg_camlp4.macro, pkg_menhirLib,
          pkg_ulex, predefine_ulex.ml, quiet, syntax_camlp4o, traverse, use_menhir .}
     
     $ocamlbuild -show-tags test.byte
     Tags for "test.byte":
       {. byte, extension:byte, file:test.byte, ocaml, pkg_menhirLib, pkg_ulex,
          program, quiet, traverse, use_menhir .}
     
     bash-3.2$ ocamlbuild -show-tags test.native
     Tags for "test.native":
       {. extension:native, file:test.native, native, ocaml, pkg_menhirLib,
          pkg_ulex, program, quiet, traverse, use_menhir .}
   #+END_SRC
   
   The built-in =_tags= file is as follows:

   #+BEGIN_SRC shell-script
     <**/*.ml>   or <**/*.mli> or <**/*.ml.depends> : ocaml 
     <**/*.byte> : ocaml, byte, program 
     <**/*.native>: ocaml, native, program
     <**/*.cma>:ocaml, byte,library
     <**/*.cmxa>:ocaml,native,library
     <**/*.cmo>:ocaml,byte
     <**/*.cmx>:ocaml,native
   #+END_SRC

   You can do some experiment do verify it, create a empty directory, and
   make a dummy ml file, then type =ocamlbuild -show-tags test.ml=,
   you will get the output as follows 

   #+BEGIN_SRC shell-script
     Tags for "test.ml": {. extension:ml, file:test.ml, ocaml, quiet .}
     \end{bashcode}
   #+END_SRC

   =<**/*.ml>= means that /.ml/ files in /current dir or sub dir/. A
  special tag made from the path name of the file relative to the
  toplevel of the project, is automatically defined for each file.
  Just as above, =test.ml= will be tagged =file:test.ml= and also
  =extension:ml=

