toolchain/ocamlbuild.html

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Tags</h3>
<div class="outline-text-3" id="text-1-2">

<p>   You can alo use <code>mlpack</code> file to do hierachical packing <code>_tags</code>
   file is for convenience.  Every source tree may have a <code>_tags</code>
   file, and each target may have a set of tags.
</p>


<p>
   You can digest the output below to get a general idea of how tags
   file work.  By preceding a tag with <i>a minus sign</i>, one can
   <code>remove</code> tags from one or more files.
</p>



<pre class="src src-shell-script">$<span style="color: #dfaf8f;">ocamlbuild</span> -show-tags test.ml

Tags for <span style="color: #cc9393;">"test.ml"</span>:
  {<span style="color: #8cd0d3;">.</span> extension:ml, file:test.ml, ocaml, pkg_camlp4.macro, pkg_menhirLib,
     pkg_ulex, predefine_ulex.ml, quiet, syntax_camlp4o, traverse, use_menhir .}

$<span style="color: #dfaf8f;">ocamlbuild</span> -show-tags test.byte
Tags for <span style="color: #cc9393;">"test.byte"</span>:
  {<span style="color: #8cd0d3;">.</span> byte, extension:byte, file:test.byte, ocaml, pkg_menhirLib, pkg_ulex,
     program, quiet, traverse, use_menhir .}

bash-3.2$ ocamlbuild -show-tags test.native
Tags for <span style="color: #cc9393;">"test.native"</span>:
  {<span style="color: #8cd0d3;">.</span> extension:native, file:test.native, native, ocaml, pkg_menhirLib,
     pkg_ulex, program, quiet, traverse, use_menhir .}
</pre>


<p>   
   The built-in <code>_tags</code> file is as follows:
</p>



<pre class="src src-shell-script">&lt;**/*.ml&gt;   or &lt;**/*.mli&gt; or &lt;**/*.ml.depends&gt; : ocaml 
&lt;**/*.byte&gt; : ocaml, byte, program 
&lt;**/*.native&gt;: ocaml, native, program
&lt;**/*.cma&gt;:ocaml, byte,library
&lt;**/*.cmxa&gt;:ocaml,native,library
&lt;**/*.cmo&gt;:ocaml,byte
&lt;**/*.cmx&gt;:ocaml,native
</pre>


<p>
   You can do some experiment do verify it, create a empty directory, and
   make a dummy ml file, then type <code>ocamlbuild -show-tags test.ml</code>,
   you will get the output as follows 
</p>



<pre class="src src-shell-script">Tags for <span style="color: #cc9393;">"test.ml"</span>: {<span style="color: #8cd0d3;">.</span> extension:ml, file:test.ml, ocaml, quiet .}
\end{bashcode}
</pre>


<p>
   <code>&lt;**/*.ml&gt;</code> means that <i>.ml</i> files in <i>current dir or sub dir</i>. A
  special tag made from the path name of the file relative to the
  toplevel of the project, is automatically defined for each file.
  Just as above, <code>test.ml</code> will be tagged <code>file:test.ml</code> and also
  <code>extension:ml</code>
</p>
</div>

</div>
