toolchain/ocamlbuild.tex
\subsection*{Tags}
\label{sec-1-2}

   You can alo use \texttt{mlpack} file to do hierachical packing \texttt{\_tags}
   file is for convenience.  Every source tree may have a \texttt{\_tags}
   file, and each target may have a set of tags.



   You can digest the output below to get a general idea of how tags
   file work.  By preceding a tag with \emph{a minus sign}, one can
   \texttt{remove} tags from one or more files.


\begin{minted}[]{bash}
$ocamlbuild -show-tags test.ml

Tags for "test.ml":
  {. extension:ml, file:test.ml, ocaml, pkg_camlp4.macro, pkg_menhirLib,
     pkg_ulex, predefine_ulex.ml, quiet, syntax_camlp4o, traverse, use_menhir .}

$ocamlbuild -show-tags test.byte
Tags for "test.byte":
  {. byte, extension:byte, file:test.byte, ocaml, pkg_menhirLib, pkg_ulex,
     program, quiet, traverse, use_menhir .}

bash-3.2$ ocamlbuild -show-tags test.native
Tags for "test.native":
  {. extension:native, file:test.native, native, ocaml, pkg_menhirLib,
     pkg_ulex, program, quiet, traverse, use_menhir .}
\end{minted}
   
   The built-in \texttt{\_tags} file is as follows:


\begin{minted}[]{bash}
<**/*.ml>   or <**/*.mli> or <**/*.ml.depends> : ocaml 
<**/*.byte> : ocaml, byte, program 
<**/*.native>: ocaml, native, program
<**/*.cma>:ocaml, byte,library
<**/*.cmxa>:ocaml,native,library
<**/*.cmo>:ocaml,byte
<**/*.cmx>:ocaml,native
\end{minted}

   You can do some experiment do verify it, create a empty directory, and
   make a dummy ml file, then type \texttt{ocamlbuild -show-tags test.ml},
   you will get the output as follows 


\begin{minted}[]{bash}
Tags for "test.ml": {. extension:ml, file:test.ml, ocaml, quiet .}
\end{bashcode}
\end{minted}

   \texttt{<**/*.ml>} means that \emph{.ml} files in \emph{current dir or sub dir}. A
  special tag made from the path name of the file relative to the
  toplevel of the project, is automatically defined for each file.
  Just as above, \texttt{test.ml} will be tagged \texttt{file:test.ml} and also
  \texttt{extension:ml}
