toolchain/ocamlbuild.org
** Handle Multiple Directories
   Suppose our directory structure is as follows 

   #+BEGIN_EXAMPLE
     |---bar
     |---baz
     |---foo
   #+END_EXAMPLE
   
   Our tags file is 

   #+BEGIN_EXAMPLE
   <bar> or <baz> : include 
   #+END_EXAMPLE

   #+CAPTION: foo/main.ml
   #+BEGIN_SRC caml
     open Printf
     let _ = begin
       print_int Barfile.i;
       print_int Bazfile.j;
     end    
   #+END_SRC

   Here module =Barfile= and =Bazfile= lie in directries
   /bar,baz/. So, after typing ocamlbuild in toplevel directory, then
   your directory structure is as follows


   #+BEGIN_EXAMPLE
        |-_build
        |---bar
        |---baz
        |---foo
        |-bar
        |-baz
        |-foo
   #+END_EXAMPLE
   What ocamlbuild did is straightforward if you read =_log=


   #+BEGIN_EXAMPLE
        bash-3.2$ cat _build/_log 
        ### Starting build.
        # Target: foo/main.ml.depends, tags: { extension:ml, file:foo/main.ml, ocaml, ocamldep, quiet, traverse }
        /opt/godi/bin/ocamldep.opt -modules foo/main.ml > foo/main.ml.depends
        # Target: bar/barfile.ml.depends, tags: { extension:ml, file:bar/barfile.ml, ocaml, ocamldep, quiet, traverse }
        /opt/godi/bin/ocamldep.opt -modules bar/barfile.ml > bar/barfile.ml.depends
        # Target: baz/bazfile.ml.depends, tags: { extension:ml, file:baz/bazfile.ml, ocaml, ocamldep, quiet, traverse }
        /opt/godi/bin/ocamldep.opt -modules baz/bazfile.ml > baz/bazfile.ml.depends
        # Target: bar/barfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:bar/barfile.cmo, file:bar/barfile.ml, implem, ocaml, quiet, traverse }
        /opt/godi/bin/ocamlc.opt -c -I bar -I baz -o bar/barfile.cmo bar/barfile.ml
        # Target: baz/bazfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:baz/bazfile.cmo, file:baz/bazfile.ml, implem, ocaml, quiet, traverse }
        /opt/godi/bin/ocamlc.opt -c -I baz -I bar -o baz/bazfile.cmo baz/bazfile.ml
        # Target: foo/main.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:foo/main.cmo, file:foo/main.ml, implem, ocaml, quiet, traverse }
        /opt/godi/bin/ocamlc.opt -c -I foo -I baz -I bar -o foo/main.cmo foo/main.ml
        # Target: foo/main.byte, tags: { byte, dont_link_with, extension:byte, file:foo/main.byte, link, ocaml, program, quiet, traverse }
        /opt/godi/bin/ocamlc.opt bar/barfile.cmo baz/bazfile.cmo foo/main.cmo -o foo/main.byte
        # Compilation successful.
#+END_EXAMPLE


   So, you can see that =-I= flags was added *for each* included
   directory and their source was copied to /_build/, =foo= was copied
   was due to our target =foo/main.byte=. They are still *flat*
   structure actually. Ocamlbuild still takes each directory /as
   source directory/ and /do santity check/. Each source tree should
   still be built using ocamlbuild, it's not easy to mix with other
   build tools. You can add =-I= flags by hand, but the relative path
   does not work perfect, due to the fact that building was done in
   =_build= directory. But the good news is that it's easy to mix c
   stubs using ocamlbuild itself.

