toolchain/ocamlbuild.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Handle Multiple Directories</h3>
<div class="outline-text-3" id="text-1-3">

<p>   Suppose our directory structure is as follows 
</p>



<pre class="example">|---bar
|---baz
|---foo
</pre>


<p>   
   Our tags file is 
</p>



<pre class="example">&lt;bar&gt; or &lt;baz&gt; : include 
</pre>



<pre class="src src-caml"><span style="color: #dfaf8f;">open</span> <span style="color: #8cd0d3;">Printf</span>
<span style="color: #8cd0d3;">let</span> _ = <span style="color: #f0dfaf; font-weight: bold;">begin</span>
  print_int <span style="color: #8cd0d3;">Barfile</span>.i;
  print_int <span style="color: #8cd0d3;">Bazfile</span>.j;
<span style="color: #f0dfaf; font-weight: bold;">end</span>    
</pre>


<p>
   Here module <code>Barfile</code> and <code>Bazfile</code> lie in directries
   <i>bar,baz</i>. So, after typing ocamlbuild in toplevel directory, then
   your directory structure is as follows
</p>




<pre class="example">|-_build
|---bar
|---baz
|---foo
|-bar
|-baz
|-foo
</pre>

<p>
   What ocamlbuild did is straightforward if you read <code>_log</code>
</p>




<pre class="example">bash-3.2$ cat _build/_log 
### Starting build.
# Target: foo/main.ml.depends, tags: { extension:ml, file:foo/main.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules foo/main.ml &gt; foo/main.ml.depends
# Target: bar/barfile.ml.depends, tags: { extension:ml, file:bar/barfile.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules bar/barfile.ml &gt; bar/barfile.ml.depends
# Target: baz/bazfile.ml.depends, tags: { extension:ml, file:baz/bazfile.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules baz/bazfile.ml &gt; baz/bazfile.ml.depends
# Target: bar/barfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:bar/barfile.cmo, file:bar/barfile.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I bar -I baz -o bar/barfile.cmo bar/barfile.ml
# Target: baz/bazfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:baz/bazfile.cmo, file:baz/bazfile.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I baz -I bar -o baz/bazfile.cmo baz/bazfile.ml
# Target: foo/main.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:foo/main.cmo, file:foo/main.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I foo -I baz -I bar -o foo/main.cmo foo/main.ml
# Target: foo/main.byte, tags: { byte, dont_link_with, extension:byte, file:foo/main.byte, link, ocaml, program, quiet, traverse }
/opt/godi/bin/ocamlc.opt bar/barfile.cmo baz/bazfile.cmo foo/main.cmo -o foo/main.byte
# Compilation successful.
</pre>



<p>
   So, you can see that <code>-I</code> flags was added <b>for each</b> included
   directory and their source was copied to <i>_build</i>, <code>foo</code> was copied
   was due to our target <code>foo/main.byte</code>. They are still <b>flat</b>
   structure actually. Ocamlbuild still takes each directory <i>as    source directory</i> and <i>do santity check</i>. Each source tree should
   still be built using ocamlbuild, it's not easy to mix with other
   build tools. You can add <code>-I</code> flags by hand, but the relative path
   does not work perfect, due to the fact that building was done in
   <code>_build</code> directory. But the good news is that it's easy to mix c
   stubs using ocamlbuild itself.
</p>
</div>

</div>
