toolchain/ocamlbuild.tex
\subsection*{Handle Multiple Directories}
\label{sec-1-3}

   Suppose our directory structure is as follows 


\begin{verbatim}
|---bar
|---baz
|---foo
\end{verbatim}
   
   Our tags file is 


\begin{verbatim}
<bar> or <baz> : include
\end{verbatim}


\begin{minted}[]{ocaml}
open Printf
let _ = begin
  print_int Barfile.i;
  print_int Bazfile.j;
end
\end{minted}

   Here module \texttt{Barfile} and \texttt{Bazfile} lie in directries
   \emph{bar,baz}. So, after typing ocamlbuild in toplevel directory, then
   your directory structure is as follows



\begin{verbatim}
|-_build
|---bar
|---baz
|---foo
|-bar
|-baz
|-foo
\end{verbatim}
   What ocamlbuild did is straightforward if you read \texttt{\_log}



\begin{verbatim}
bash-3.2$ cat _build/_log 
### Starting build.
# Target: foo/main.ml.depends, tags: { extension:ml, file:foo/main.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules foo/main.ml > foo/main.ml.depends
# Target: bar/barfile.ml.depends, tags: { extension:ml, file:bar/barfile.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules bar/barfile.ml > bar/barfile.ml.depends
# Target: baz/bazfile.ml.depends, tags: { extension:ml, file:baz/bazfile.ml, ocaml, ocamldep, quiet, traverse }
/opt/godi/bin/ocamldep.opt -modules baz/bazfile.ml > baz/bazfile.ml.depends
# Target: bar/barfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:bar/barfile.cmo, file:bar/barfile.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I bar -I baz -o bar/barfile.cmo bar/barfile.ml
# Target: baz/bazfile.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:baz/bazfile.cmo, file:baz/bazfile.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I baz -I bar -o baz/bazfile.cmo baz/bazfile.ml
# Target: foo/main.cmo, tags: { byte, compile, extension:cmo, extension:ml, file:foo/main.cmo, file:foo/main.ml, implem, ocaml, quiet, traverse }
/opt/godi/bin/ocamlc.opt -c -I foo -I baz -I bar -o foo/main.cmo foo/main.ml
# Target: foo/main.byte, tags: { byte, dont_link_with, extension:byte, file:foo/main.byte, link, ocaml, program, quiet, traverse }
/opt/godi/bin/ocamlc.opt bar/barfile.cmo baz/bazfile.cmo foo/main.cmo -o foo/main.byte
# Compilation successful.
\end{verbatim}


   So, you can see that \texttt{-I} flags was added \textbf{for each} included
   directory and their source was copied to \emph{_build}, \texttt{foo} was copied
   was due to our target \texttt{foo/main.byte}. They are still \textbf{flat}
   structure actually. Ocamlbuild still takes each directory \emph{as    source directory} and \emph{do santity check}. Each source tree should
   still be built using ocamlbuild, it's not easy to mix with other
   build tools. You can add \texttt{-I} flags by hand, but the relative path
   does not work perfect, due to the fact that building was done in
   \texttt{\_build} directory. But the good news is that it's easy to mix c
   stubs using ocamlbuild itself.
