toolchain/ocamlbuild.org
** Packing
   - Binary, it's pretty easy
     create a file =a.mlpack=

     #+CAPTION: a.mlpack
     #+BEGIN_EXAMPLE
       Bli
       Blo
       Blu
     #+END_EXAMPLE
     
     Then type =ocamlbuild a.mco= is enough, ocamlbuild will emit
     command line such as this
     
     #+BEGIN_EXAMPLE
     ocamlc.opt -pack foo.cmo bar.cmo -o a.cmo
     #+END_EXAMPLE
     
     Packing modules in other directories is straightforward

     #+BEGIN_EXAMPLE
     other1/Bli
     other2/Blo
     other3/Blu
     #+END_EXAMPLE

   
   The previous approach doesn't work if the files /bli.ml, blo.ml and
   blu.ml/ depend on each other and are in different
   directories. Let's assume that =blo.ml= depends on =bli.ml=. If
   they are in the same direcory, there is no problem because =Blo=
   sees the whole content of its directory. But if =otherdir1= and
   =otherdir2= are different, then you get an error because =Bli= is
   unbound in =Blo=.


   One solution would be to use the /-I/ option: this approach will
   lead to a name clash.  Another solution is to write a plugin for
   Ocamlbuild. In our example, it is sufficient to say that the files
   in the directory =otherdir2= should see the content of both =otherdir1=
   and =otherdir2=.

   To do this we use the API function =Pathname.define_context=. Write
   the following myocamlbuild.ml in your main directory:

   #+BEGIN_SRC tuareg -n -r 
     open Ocamlbuild_plugin;;
     
     dispatch begin function
       | After_rules ->
           Pathname.define_context "otherdir2" ["otherdir1"; "otherdir2"]
       | _ -> ()
     end
   #+END_SRC
   Now you should be able to compile, using:
   =ocamlbuild main.byte=

   - Native
     In the tags file, typing something like
     #+BEGIN_EXAMPLE
     <bl{i,o,u}.cmx>: for-pack(A) 
     #+END_EXAMPLE
     The initial packing module needs to be write =in a capital letter=
     
** Grouping Targets
   You can also  group your targets /foo.itarget, foo.otarget/

   #+BEGIN_EXAMPLE
     cat foo.itarget
     main.native
     main.byte 
     stuff.docdir/index.html    
   #+END_EXAMPLE
   Then you can say =ocamlbuild foo.otarget=

** Debugging

   For debugging and profiling name your target either /.d.byte/
   or /.p.native/ or add a tag in =_tags= file /true:debug/.


   To debug ocmalbuild, you can add options like =-verbose 10=

** Documentation

   To build documentation, create a file called /foo.odocl/, then
   write the modules you want to document, then build the target
   =foo.docdir/index.html=. When you use =-keep-code= flag in
   myocamlbuild.ml, only document of exposed modules are kept, which
   means that only the modules /that don't have signature file/ will
   keep the source code. This is due to the fact that ocamldoc will
   try to process /mli/ first, otherwise /ml/ file.

   You can add such a line in your myocamlbuild.ml plugin


   #+BEGIN_SRC caml
     flag ["ocaml"; "doc"] & S[A"-keep-code"];
   #+END_SRC
   Or you can do it by hand

   #+BEGIN_EXAMPLE
     ocamlbuild -ocamldoc 'ocamlfind ocamldoc -keep-code' foo.docdir/index.html
   #+END_EXAMPLE

   ocamldep seems to be lightweight to generate the dependency.  You
   can write a snippet code using ocamlgraphto generate the dependency
   graph without bothering ocamldoc

** TODO Glob patterns

** Lex Yacc
    /mll, mly/ files are supported by default, you can use menhir
    =-use-menhir= or add a line =true : use_menhir= Add a line in tags
    file

