toolchain/ocamlbuild.html

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Packing</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>Binary, it's pretty easy
     create a file <code>a.mlpack</code>




<pre class="example">Bli
Blo
Blu
</pre>


<p>     
     Then type <code>ocamlbuild a.mco</code> is enough, ocamlbuild will emit
     command line such as this
</p>



<pre class="example">ocamlc.opt -pack foo.cmo bar.cmo -o a.cmo
</pre>


<p>     
     Packing modules in other directories is straightforward
</p>



<pre class="example">other1/Bli
other2/Blo
other3/Blu
</pre>

</li>
</ul>



<p>   
   The previous approach doesn't work if the files <i>bli.ml, blo.ml and    blu.ml</i> depend on each other and are in different
   directories. Let's assume that <code>blo.ml</code> depends on <code>bli.ml</code>. If
   they are in the same direcory, there is no problem because <code>Blo</code>
   sees the whole content of its directory. But if <code>otherdir1</code> and
   <code>otherdir2</code> are different, then you get an error because <code>Bli</code> is
   unbound in <code>Blo</code>.
</p>

<p>
   One solution would be to use the <i>-I</i> option: this approach will
   lead to a name clash.  Another solution is to write a plugin for
   Ocamlbuild. In our example, it is sufficient to say that the files
   in the directory <code>otherdir2</code> should see the content of both <code>otherdir1</code>
   and <code>otherdir2</code>.
</p>
<p>
   To do this we use the API function <code>Pathname.define_context</code>. Write
   the following myocamlbuild.ml in your main directory:
</p>



<pre class="src src-tuareg"><span class="linenr">1:  </span><span style="color: #ff7f00; font-weight: bold;">open</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span><span style="color: #eadd83;">;;</span>
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>dispatch <span style="color: #ff7f00; font-weight: bold;">begin</span> <span style="color: #f0dfaf; font-weight: bold;">function</span>
<span class="linenr">4:  </span> <span style="color: #dfaf8f;"> </span><span style="color: #eadd83;">|</span> After_rules <span style="color: #eadd83;">-&gt;</span>
<span class="linenr">5:  </span>      <span style="color: #8cd0d3;">Pathname</span>.define_context <span style="color: #cc9393;">"otherdir2"</span> <span style="color: #eadd83;">[</span><span style="color: #cc9393;">"otherdir1"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"otherdir2"</span><span style="color: #eadd83;">]</span>
<span class="linenr">6:  </span>  <span style="color: #eadd83;">|</span> _ <span style="color: #eadd83;">-&gt;</span> <span style="color: #eadd83;">()</span>
<span class="linenr">7:  </span><span style="color: #ff7f00; font-weight: bold;">end</span>
</pre>

<p>
   Now you should be able to compile, using:
   <code>ocamlbuild main.byte</code>
</p>
<ul>
<li>Native
     In the tags file, typing something like



<pre class="example">&lt;bl{i,o,u}.cmx&gt;: for-pack(A) 
</pre>

<p>
     The initial packing module needs to be write <code>in a capital letter</code>
</p></li>
</ul>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Grouping Targets</h3>
<div class="outline-text-3" id="text-1-5">

<p>   You can also  group your targets <i>foo.itarget, foo.otarget</i>
</p>



<pre class="example">cat foo.itarget
main.native
main.byte 
stuff.docdir/index.html    
</pre>

<p>
   Then you can say <code>ocamlbuild foo.otarget</code>
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Debugging</h3>
<div class="outline-text-3" id="text-1-6">


<p>
   For debugging and profiling name your target either <i>.d.byte</i>
   or <i>.p.native</i> or add a tag in <code>_tags</code> file <i>true:debug</i>.
</p>

<p>
   To debug ocmalbuild, you can add options like <code>-verbose 10</code>
</p>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Documentation</h3>
<div class="outline-text-3" id="text-1-7">


<p>
   To build documentation, create a file called <i>foo.odocl</i>, then
   write the modules you want to document, then build the target
   <code>foo.docdir/index.html</code>. When you use <code>-keep-code</code> flag in
   myocamlbuild.ml, only document of exposed modules are kept, which
   means that only the modules <i>that don't have signature file</i> will
   keep the source code. This is due to the fact that ocamldoc will
   try to process <i>mli</i> first, otherwise <i>ml</i> file.
</p>
<p>
   You can add such a line in your myocamlbuild.ml plugin
</p>




<pre class="src src-caml">flag [<span style="color: #cc9393;">"ocaml"</span>; <span style="color: #cc9393;">"doc"</span>] <span style="color: #bfebbf;">&amp;</span> <span style="color: #8cd0d3;">S</span>[<span style="color: #8cd0d3;">A</span><span style="color: #cc9393;">"-keep-code"</span>];
</pre>

<p>
   Or you can do it by hand
</p>



<pre class="example">ocamlbuild -ocamldoc 'ocamlfind ocamldoc -keep-code' foo.docdir/index.html
</pre>


<p>
   ocamldep seems to be lightweight to generate the dependency.  You
   can write a snippet code using ocamlgraphto generate the dependency
   graph without bothering ocamldoc
</p>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="todo TODO"> TODO</span> Glob patterns</h3>
<div class="outline-text-3" id="text-1-8">


</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">Lex Yacc</h3>
<div class="outline-text-3" id="text-1-9">

<p>    <i>mll, mly</i> files are supported by default, you can use menhir
    <code>-use-menhir</code> or add a line <code>true : use_menhir</code> Add a line in tags
    file
</p>
</div>

</div>
