toolchain/ocamlbuild.tex
\subsection*{Packing}
\label{sec-1-4}

\begin{itemize}
\item Binary, it's pretty easy
     create a file \texttt{a.mlpack}


\begin{verbatim}
Bli
Blo
Blu
\end{verbatim}
     
     Then type \texttt{ocamlbuild a.mco} is enough, ocamlbuild will emit
     command line such as this
     

\begin{verbatim}
ocamlc.opt -pack foo.cmo bar.cmo -o a.cmo
\end{verbatim}
     
     Packing modules in other directories is straightforward


\begin{verbatim}
other1/Bli
other2/Blo
other3/Blu
\end{verbatim}
\end{itemize}

   
   The previous approach doesn't work if the files \emph{bli.ml, blo.ml and    blu.ml} depend on each other and are in different
   directories. Let's assume that \texttt{blo.ml} depends on \texttt{bli.ml}. If
   they are in the same direcory, there is no problem because \texttt{Blo}
   sees the whole content of its directory. But if \texttt{otherdir1} and
   \texttt{otherdir2} are different, then you get an error because \texttt{Bli} is
   unbound in \texttt{Blo}.


   One solution would be to use the \emph{-I} option: this approach will
   lead to a name clash.  Another solution is to write a plugin for
   Ocamlbuild. In our example, it is sufficient to say that the files
   in the directory \texttt{otherdir2} should see the content of both \texttt{otherdir1}
   and \texttt{otherdir2}.

   To do this we use the API function \texttt{Pathname.define\_context}. Write
   the following myocamlbuild.ml in your main directory:


\begin{minted}[]{tuareg}
1:  open Ocamlbuild_plugin;;
2:  
3:  dispatch begin function
4:    | After_rules ->
5:        Pathname.define_context "otherdir2" ["otherdir1"; "otherdir2"]
6:    | _ -> ()
7:  end
\end{minted}
   Now you should be able to compile, using:
   \texttt{ocamlbuild main.byte}

\begin{itemize}
\item Native
     In the tags file, typing something like

\begin{verbatim}
<bl{i,o,u}.cmx>: for-pack(A)
\end{verbatim}
     The initial packing module needs to be write \texttt{in a capital letter}
\end{itemize}
     
\subsection*{Grouping Targets}
\label{sec-1-5}

   You can also  group your targets \emph{foo.itarget, foo.otarget}


\begin{verbatim}
cat foo.itarget
main.native
main.byte 
stuff.docdir/index.html
\end{verbatim}
   Then you can say \texttt{ocamlbuild foo.otarget}
\subsection*{Debugging}
\label{sec-1-6}


   For debugging and profiling name your target either \emph{.d.byte}
   or \emph{.p.native} or add a tag in \texttt{\_tags} file \emph{true:debug}.


   To debug ocmalbuild, you can add options like \texttt{-verbose 10}
\subsection*{Documentation}
\label{sec-1-7}


   To build documentation, create a file called \emph{foo.odocl}, then
   write the modules you want to document, then build the target
   \texttt{foo.docdir/index.html}. When you use \texttt{-keep-code} flag in
   myocamlbuild.ml, only document of exposed modules are kept, which
   means that only the modules \emph{that don't have signature file} will
   keep the source code. This is due to the fact that ocamldoc will
   try to process \emph{mli} first, otherwise \emph{ml} file.

   You can add such a line in your myocamlbuild.ml plugin



\begin{minted}[]{ocaml}
flag ["ocaml"; "doc"] & S[A"-keep-code"];
\end{minted}
   Or you can do it by hand


\begin{verbatim}
ocamlbuild -ocamldoc 'ocamlfind ocamldoc -keep-code' foo.docdir/index.html
\end{verbatim}

   ocamldep seems to be lightweight to generate the dependency.  You
   can write a snippet code using ocamlgraphto generate the dependency
   graph without bothering ocamldoc
\subsection*{\textbf{TODO} Glob patterns}
\label{sec-1-8}
\subsection*{Lex Yacc}
\label{sec-1-9}

    \emph{mll, mly} files are supported by default, you can use menhir
    \texttt{-use-menhir} or add a line \texttt{true : use\_menhir} Add a line in tags
    file
