toolchain/ocamlbuild.org
** ocamlfind
    #+BEGIN_EXAMPLE
      <*.ml> : pkg_sexplib.syntax, pkg_batteries.syntax, syntax_camlp4o
    #+END_EXAMPLE

    Here =syntax_camlp4o= is translated by myocamlbuild.ml to =-syntax
    camlp4o= to pass to ocamlfind. =Pkg= needs =ocamlbuild plugin=
    support as well. ocamlfind can understand =-syntax camlp4o=.

    Examples with Syntax extension
    #+BEGIN_EXAMPLE
      <*.ml>: package(lwt.unix), package(lwt.syntax), syntax(camlp4o) # only needs lwt.syntax when prepossessing
      "prog.byte": package(lwt.unix)
    #+END_EXAMPLE

    Since 3.12,, you can use =-use-ocamlfind= to activate. ocamlfind
    predicates can be activated with the =predicate(...)= tag, like
    =package=



    #+BEGIN_EXAMPLE
      <*.ml>: package(lwt.unix), package(lwt.syntax), syntax(camlp4o)
      "prog.byte": package(lwt.unix)
    #+END_EXAMPLE

    ocamlbuild *cares* white space, *take care when write tags file*
   
** Preprocessing
   For preprocessing you can tag the file either =-pp= or tags =pp(cmd
   ...)=

   There are two style to cooperate with syntax extension, one way is
   described above, making use of ocamlfind, in most case it works,
   but it does not work very well considering you want to build
   =.ml.ppo= and other stuff. And you introduce another dependency on
   ocamlfind

   The other way is to use =pp= directly, you could sym link your
   extension file to =camlp4 -where=. I found this way is =more=
   natural. And to make things even better, you don't need to symlink,
   you can finish this by using myocamlbuild.ml

   There's another case you may use syntax extension
   locally when developing  we will introduce it later.

   We can see different styles here.


   #+BEGIN_EXAMPLE
     <pa_*r.{ml,cmo,byte}> : pkg_dynlink , pp(camlp4rf ), use_camlp4_full
     <*_ulex.{byte,native}> : pkg_ulex 
     
     
     
     <pa_vector_r.{cmo,byte,native}>:pkg_dynlink,use_camlp4_full,pkg_sexplib 
     "map_filter_r.ml" : pp(camlp4r -filter map)
     "wiki_r.ml" or "wiki2_r.ml"  : pp(camlp4rf -filter meta), use_camlp4_full
     "wiki2_r.mli" : use_camlp4_full
     
     pa_vector_r.ml:syntax_camlp4r,pkg_camlp4.quotations.r,pkg_camlp4.extend,pkg_sexplib.syntax
     <*_o.ml> : syntax_camlp4o,pkg_sexplib.syntax
     <*_ulex.ml> : syntax_camlp4o,pkg_ulex,pkg_camlp4.macro  
     <*_r.ml>:syntax_camlp4r,pkg_camlp4.quotations.r,pkg_camlp4.macro,pkg_camlp4.extend 
   #+END_EXAMPLE

   Actually, =pp= is not needed here, ocamlbuild is smart
   enough to infer it as /.ml/ tag.


   The /.mli/ file also needs tags. For syntax extension, /order
   matters/. When you use =pp= flag, you need to specify the path to
   =pa_xx.cmo=, so symbol link may help, but you can refer to
   myocamlbuild.ml, to save you from this tedious work.

