toolchain/ocamlbuild.html

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10">ocamlfind</h3>
<div class="outline-text-3" id="text-1-10">




<pre class="example">&lt;*.ml&gt; : pkg_sexplib.syntax, pkg_batteries.syntax, syntax_camlp4o
</pre>


<p>
    Here <code>syntax_camlp4o</code> is translated by myocamlbuild.ml to <code>-syntax     camlp4o</code> to pass to ocamlfind. <code>Pkg</code> needs <code>ocamlbuild plugin</code>
    support as well. ocamlfind can understand <code>-syntax camlp4o</code>.
</p>
<p>
    Examples with Syntax extension
</p>


<pre class="example">&lt;*.ml&gt;: package(lwt.unix), package(lwt.syntax), syntax(camlp4o) # only needs lwt.syntax when prepossessing
"prog.byte": package(lwt.unix)
</pre>


<p>
    Since 3.12,, you can use <code>-use-ocamlfind</code> to activate. ocamlfind
    predicates can be activated with the <code>predicate(...)</code> tag, like
    <code>package</code>
</p>





<pre class="example">&lt;*.ml&gt;: package(lwt.unix), package(lwt.syntax), syntax(camlp4o)
"prog.byte": package(lwt.unix)
</pre>


<p>
    ocamlbuild <b>cares</b> white space, <b>take care when write tags file</b>
</p>
</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11">Preprocessing</h3>
<div class="outline-text-3" id="text-1-11">

<p>   For preprocessing you can tag the file either <code>-pp</code> or tags <code>pp(cmd    ...)</code>
</p>
<p>
   There are two style to cooperate with syntax extension, one way is
   described above, making use of ocamlfind, in most case it works,
   but it does not work very well considering you want to build
   <code>.ml.ppo</code> and other stuff. And you introduce another dependency on
   ocamlfind
</p>
<p>
   The other way is to use <code>pp</code> directly, you could sym link your
   extension file to <code>camlp4 -where</code>. I found this way is <code>more</code>
   natural. And to make things even better, you don't need to symlink,
   you can finish this by using myocamlbuild.ml
</p>
<p>
   There's another case you may use syntax extension
   locally when developing  we will introduce it later.
</p>
<p>
   We can see different styles here.
</p>




<pre class="example">&lt;pa_*r.{ml,cmo,byte}&gt; : pkg_dynlink , pp(camlp4rf ), use_camlp4_full
&lt;*_ulex.{byte,native}&gt; : pkg_ulex 



&lt;pa_vector_r.{cmo,byte,native}&gt;:pkg_dynlink,use_camlp4_full,pkg_sexplib 
"map_filter_r.ml" : pp(camlp4r -filter map)
"wiki_r.ml" or "wiki2_r.ml"  : pp(camlp4rf -filter meta), use_camlp4_full
"wiki2_r.mli" : use_camlp4_full

pa_vector_r.ml:syntax_camlp4r,pkg_camlp4.quotations.r,pkg_camlp4.extend,pkg_sexplib.syntax
&lt;*_o.ml&gt; : syntax_camlp4o,pkg_sexplib.syntax
&lt;*_ulex.ml&gt; : syntax_camlp4o,pkg_ulex,pkg_camlp4.macro  
&lt;*_r.ml&gt;:syntax_camlp4r,pkg_camlp4.quotations.r,pkg_camlp4.macro,pkg_camlp4.extend 
</pre>


<p>
   Actually, <code>pp</code> is not needed here, ocamlbuild is smart
   enough to infer it as <i>.ml</i> tag.
</p>

<p>
   The <i>.mli</i> file also needs tags. For syntax extension, <i>order    matters</i>. When you use <code>pp</code> flag, you need to specify the path to
   <code>pa_xx.cmo</code>, so symbol link may help, but you can refer to
   myocamlbuild.ml, to save you from this tedious work.
</p>

</div>
