toolchain/ocamlbuild.org
*** Built in flags
   Some built-in tags like =use_camlp4=, =use_camlp4_full= was
   propogated from =.ml= to =.odoc=, or more, they should be used
   separately from the syntax extensions

   The =_log= output is a typical processing by ocamlbuild


   #+BEGIN_EXAMPLE
     <gen_printer.ml> : use_camlp4, camlp4rf
     # Target: gen_printer.ml.depends, tags: { camlp4rf, extension:ml, file:gen_printer.ml, ocaml, ocamldep, quiet, traverse, use_camlp4 }
     ocamlfind ocamldep -pp camlp4rf -modules gen_printer.ml > gen_printer.ml.depends # cached
     # Target: util.mli.depends, tags: { extension:mli, file:util.mli, ocaml, ocamldep, quiet, traverse, use_camlp4 }
     ocamlfind ocamldep -modules util.mli > util.mli.depends # cached
     # Target: util.cmi, tags: { byte, compile, extension:mli, file:util.mli, interf, ocaml, quiet, traverse, use_camlp4 }
     ocamlfind ocamlc -annot -c -I +camlp4 -o util.cmi util.mli # cached
     # Target: gen_printer.odoc, tags: { camlp4rf, doc, extension:ml, file:gen_printer.ml, implem, ocaml, quiet, traverse, use_camlp4 }
     ocamlfind ocamldoc -dump gen_printer.odoc -I +camlp4 -I +camlp4 -pp camlp4rf gen_printer.ml # cached
     # Target: foo.docdir/gen_printer.dot, tags: {  }
     rm -rf foo.docdir/gen_printer.dot
     # Target: foo.docdir, tags: {  }
     mkdir -p foo.docdir
     # Target: foo.docdir/gen_printer.dot, tags: { doc, docfile, extension:docdir, extension:dot, file:foo.docdir, file:foo.docdir/gen_printer.dot, ocaml, quiet, traverse }
     ocamlfind ocamldoc -load gen_printer.odoc -dot -o foo.docdir/gen_printer.dot
     # Compilation successful.
   #+END_EXAMPLE

   Here for the file =gen_printer.ml=, both tags are necessary 
   For options =-ppflag=, and =-pp=, the source

   #+CAPTION: Options.ml
   #+BEGIN_SRC tuareg -n -r
     "-ppflag", String (add_to' ocaml_ppflags_internal), "<flag> Add to ocaml preprocessing flags";
     "-pp", String (add_to ocaml_ppflags_internal), "<flag,...> (idem)";
     let add_to rxs x =
       let xs = Lexers.comma_or_blank_sep_strings (Lexing.from_string x) in
       rxs := xs :: !rxs
     let add_to' rxs x =
       if x <> dummy then
         rxs := [x] :: !rxs
       else
         ()
   #+END_SRC
   
** Principles

   There's an [[http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/][OCamlbuild API Documentation]] for comprehensive study.b

*** Rules
    A rule is composed of triple (Tags, Targets,
    Dependencies). ocamlbuild for all rules that are valid for this
    target.  You can set =-verbose 10= to get the backtrace in
    case of a failure.

    There are 3 stages,(hygiene, options(parsing the command line
    options), rules(adding the default rules to the system)). You
    can add hooks to what you want.

    #+BEGIN_EXAMPLE
    {Before|After}_{options|hygiene|rules}    
    #+END_EXAMPLE

    To change the options, simply refer to the [[http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Options.html][Options]] module. Read
    source file =ocaml_specific= to learn more.

*** Customize plugin
