toolchain/ocamlbuild.html

<div id="outline-container-1-11-1" class="outline-4">
<h4 id="sec-1-11-1">Built in flags</h4>
<div class="outline-text-4" id="text-1-11-1">

<p>   Some built-in tags like <code>use_camlp4</code>, <code>use_camlp4_full</code> was
   propogated from <code>.ml</code> to <code>.odoc</code>, or more, they should be used
   separately from the syntax extensions
</p>
<p>
   The <code>_log</code> output is a typical processing by ocamlbuild
</p>




<pre class="example">&lt;gen_printer.ml&gt; : use_camlp4, camlp4rf
# Target: gen_printer.ml.depends, tags: { camlp4rf, extension:ml, file:gen_printer.ml, ocaml, ocamldep, quiet, traverse, use_camlp4 }
ocamlfind ocamldep -pp camlp4rf -modules gen_printer.ml &gt; gen_printer.ml.depends # cached
# Target: util.mli.depends, tags: { extension:mli, file:util.mli, ocaml, ocamldep, quiet, traverse, use_camlp4 }
ocamlfind ocamldep -modules util.mli &gt; util.mli.depends # cached
# Target: util.cmi, tags: { byte, compile, extension:mli, file:util.mli, interf, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamlc -annot -c -I +camlp4 -o util.cmi util.mli # cached
# Target: gen_printer.odoc, tags: { camlp4rf, doc, extension:ml, file:gen_printer.ml, implem, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamldoc -dump gen_printer.odoc -I +camlp4 -I +camlp4 -pp camlp4rf gen_printer.ml # cached
# Target: foo.docdir/gen_printer.dot, tags: {  }
rm -rf foo.docdir/gen_printer.dot
# Target: foo.docdir, tags: {  }
mkdir -p foo.docdir
# Target: foo.docdir/gen_printer.dot, tags: { doc, docfile, extension:docdir, extension:dot, file:foo.docdir, file:foo.docdir/gen_printer.dot, ocaml, quiet, traverse }
ocamlfind ocamldoc -load gen_printer.odoc -dot -o foo.docdir/gen_printer.dot
# Compilation successful.
</pre>


<p>
   Here for the file <code>gen_printer.ml</code>, both tags are necessary 
   For options <code>-ppflag</code>, and <code>-pp</code>, the source
</p>



<pre class="src src-tuareg"><span class="linenr"> 1:  </span><span style="color: #cc9393;">"-ppflag"</span><span style="color: #eadd83;">,</span> String <span style="color: #eadd83;">(</span>add_to<span style="color: #eadd83;">'</span> ocaml_ppflags_internal<span style="color: #eadd83;">),</span> <span style="color: #cc9393;">"&lt;flag&gt; Add to ocaml preprocessing flags"</span><span style="color: #eadd83;">;</span>
<span class="linenr"> 2:  </span><span style="color: #cc9393;">"-pp"</span><span style="color: #eadd83;">,</span> String <span style="color: #eadd83;">(</span>add_to ocaml_ppflags_internal<span style="color: #eadd83;">),</span> <span style="color: #cc9393;">"&lt;flag,...&gt; (idem)"</span><span style="color: #eadd83;">;</span>
<span class="linenr"> 3:  </span><span style="color: #ff7f00; font-weight: bold;">let</span> <span style="color: #8cd0d3;">add_to</span><span style="color: #dfaf8f;"> rxs x </span><span style="color: #eadd83;">=</span>
<span class="linenr"> 4:  </span>  <span style="color: #ff7f00; font-weight: bold;">let</span> <span style="color: #dfaf8f;">xs </span><span style="color: #eadd83;">=</span> <span style="color: #8cd0d3;">Lexers</span>.comma_or_blank_sep_strings <span style="color: #eadd83;">(</span><span style="color: #8cd0d3;">Lexing</span>.from_string x<span style="color: #eadd83;">)</span> <span style="color: #ff7f00; font-weight: bold;">in</span>
<span class="linenr"> 5:  </span>  rxs <span style="color: #eadd83;">:=</span> xs <span style="color: #eadd83;">::</span> <span style="color: #eadd83;">!</span>rxs
<span class="linenr"> 6:  </span><span style="color: #ff7f00; font-weight: bold;">let</span> <span style="color: #8cd0d3;">add_to</span><span style="color: #eadd83;">'</span><span style="color: #dfaf8f;"> rxs x </span><span style="color: #eadd83;">=</span>
<span class="linenr"> 7:  </span>  <span style="color: #f0dfaf; font-weight: bold;">if</span> x <span style="color: #eadd83;">&lt;&gt;</span> dummy <span style="color: #f0dfaf; font-weight: bold;">then</span>
<span class="linenr"> 8:  </span>    rxs <span style="color: #eadd83;">:=</span> <span style="color: #eadd83;">[</span>x<span style="color: #eadd83;">]</span> <span style="color: #eadd83;">::</span> <span style="color: #eadd83;">!</span>rxs
<span class="linenr"> 9:  </span>  <span style="color: #f0dfaf; font-weight: bold;">else</span>
<span class="linenr">10:  </span>    <span style="color: #eadd83;">()</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12">Principles</h3>
<div class="outline-text-3" id="text-1-12">


<p>
   There's an <a href="http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/">OCamlbuild API Documentation</a> for comprehensive study.b
</p>

</div>

<div id="outline-container-1-12-1" class="outline-4">
<h4 id="sec-1-12-1">Rules</h4>
<div class="outline-text-4" id="text-1-12-1">

<p>    A rule is composed of triple (Tags, Targets,
    Dependencies). ocamlbuild for all rules that are valid for this
    target.  You can set <code>-verbose 10</code> to get the backtrace in
    case of a failure.
</p>
<p>
    There are 3 stages,(hygiene, options(parsing the command line
    options), rules(adding the default rules to the system)). You
    can add hooks to what you want.
</p>



<pre class="example">{Before|After}_{options|hygiene|rules}    
</pre>


<p>
    To change the options, simply refer to the <a href="http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Options.html">Options</a> module. Read
    source file <code>ocaml_specific</code> to learn more.
</p>
</div>

</div>

<div id="outline-container-1-12-2" class="outline-4">
<h4 id="sec-1-12-2">Customize plugin</h4>
<div class="outline-text-4" id="text-1-12-2">

<ul>
