toolchain/ocamlbuild.tex
\subsubsection*{Built in flags}
\label{sec-1-11-1}

   Some built-in tags like \texttt{use\_camlp4}, \texttt{use\_camlp4\_full} was
   propogated from \texttt{.ml} to \texttt{.odoc}, or more, they should be used
   separately from the syntax extensions

   The \texttt{\_log} output is a typical processing by ocamlbuild



\begin{verbatim}
<gen_printer.ml> : use_camlp4, camlp4rf
# Target: gen_printer.ml.depends, tags: { camlp4rf, extension:ml, file:gen_printer.ml, ocaml, ocamldep, quiet, traverse, use_camlp4 }
ocamlfind ocamldep -pp camlp4rf -modules gen_printer.ml > gen_printer.ml.depends # cached
# Target: util.mli.depends, tags: { extension:mli, file:util.mli, ocaml, ocamldep, quiet, traverse, use_camlp4 }
ocamlfind ocamldep -modules util.mli > util.mli.depends # cached
# Target: util.cmi, tags: { byte, compile, extension:mli, file:util.mli, interf, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamlc -annot -c -I +camlp4 -o util.cmi util.mli # cached
# Target: gen_printer.odoc, tags: { camlp4rf, doc, extension:ml, file:gen_printer.ml, implem, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamldoc -dump gen_printer.odoc -I +camlp4 -I +camlp4 -pp camlp4rf gen_printer.ml # cached
# Target: foo.docdir/gen_printer.dot, tags: {  }
rm -rf foo.docdir/gen_printer.dot
# Target: foo.docdir, tags: {  }
mkdir -p foo.docdir
# Target: foo.docdir/gen_printer.dot, tags: { doc, docfile, extension:docdir, extension:dot, file:foo.docdir, file:foo.docdir/gen_printer.dot, ocaml, quiet, traverse }
ocamlfind ocamldoc -load gen_printer.odoc -dot -o foo.docdir/gen_printer.dot
# Compilation successful.
\end{verbatim}

   Here for the file \texttt{gen\_printer.ml}, both tags are necessary 
   For options \texttt{-ppflag}, and \texttt{-pp}, the source


\begin{minted}[]{tuareg}
 1:  "-ppflag", String (add_to' ocaml_ppflags_internal), "<flag> Add to ocaml preprocessing flags";
 2:  "-pp", String (add_to ocaml_ppflags_internal), "<flag,...> (idem)";
 3:  let add_to rxs x =
 4:    let xs = Lexers.comma_or_blank_sep_strings (Lexing.from_string x) in
 5:    rxs := xs :: !rxs
 6:  let add_to' rxs x =
 7:    if x <> dummy then
 8:      rxs := [x] :: !rxs
 9:    else
10:      ()
\end{minted}
   
\subsection*{Principles}
\label{sec-1-12}


   There's an \href{http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/}{OCamlbuild API Documentation} for comprehensive study.b
\subsubsection*{Rules}
\label{sec-1-12-1}

    A rule is composed of triple (Tags, Targets,
    Dependencies). ocamlbuild for all rules that are valid for this
    target.  You can set \texttt{-verbose 10} to get the backtrace in
    case of a failure.

    There are 3 stages,(hygiene, options(parsing the command line
    options), rules(adding the default rules to the system)). You
    can add hooks to what you want.


\begin{verbatim}
{Before|After}_{options|hygiene|rules}
\end{verbatim}

    To change the options, simply refer to the \href{http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Options.html}{Options} module. Read
    source file \texttt{ocaml\_specific} to learn more.
\subsubsection*{Customize plugin}
\label{sec-1-12-2}
\begin{itemize}
