toolchain/ocamlbuild.org
**** OCamlbuild in the toplevel 

     #+CAPTION: ocamlbuild startup file

     Now you can do a lot of amazing things in the toplevel and write
     complex plugin system.


     We can play toplevel here



     #+BEGIN_SRC caml
       rule;;
       - : string ->
           ?tags:string list ->
           ?prods:string list ->
           ?deps:string list ->
           ?prod:string ->
           ?dep:string ->
           ?stamp:string ->
           ?insert:[ `after of string | `before of string | `bottom | `top ] ->
           Ocamlbuild_plugin.action -> unit
       = <fun>
       # tags_of_pathname;;
       - : Ocamlbuild_plugin.Pathname.t -> Ocamlbuild_plugin.Tags.t = <fun>
       # tag_file;;
       - : Ocamlbuild_plugin.Pathname.t -> Ocamlbuild_plugin.Tags.elt list -> unit =
       <fun>
       # flag;;
       - : Ocamlbuild_plugin.Tags.elt list -> Ocamlbuild_plugin.Command.spec -> unit
       = <fun>
       # dep;;
       - : Ocamlbuild_plugin.Tags.elt list ->
           Ocamlbuild_plugin.Pathname.t list -> unit
       = <fun>
     #+END_SRC

     The first argument is the name of the rule(uniqueness required),
     =~dep= is the dependency, =~prod= is the production.

     For example with rule
     #+BEGIN_EXAMPLE
     ~dep:"%.ml" ~prod:"%.byte" 
     #+END_EXAMPLE
     You can produce bla.byte from bal.ml

     There are some predefined commands such as Unix
     commands(cp,mv,...) as well.
     The sample code is a built-in rule in myocamlbuild source tree


     #+BEGIN_SRC caml
       flag ["ocaml"; "compile"; "thread"] (A "-thread")  
     #+END_SRC

     It says when tags /ocaml, compile, thread/ are met together,
     /-thread/ option should be emitted.

     You can go through the source code and read


     #+BEGIN_SRC caml
       let flag tags flags = set_flags (Tags.of_list tags) flags
       let dep tags deps = set_deps_of_tags (Tags.of_list tags) deps  
     #+END_SRC


     You can digger further and will find that =Tags.t= is actually
     =Set.Make(String).t=, but exported as an abstract type.

     [[http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Command.html][Command]] module provides a bunch of useful API as well.

     Options contains mutable references to be configured
**** Plugin Examples
***** AlphaCaml
#+INCLUDE ../code/ocamlbuild/alphacaml.ml src tuareg -n -r


      Here we show how to use rule in line [8-13], it means when
      you want to build /ml,mli/ files, it will try to build it from
      /mla/ first.

      To make it complete, for alphaCaml, you need some c stubs,

      #+BEGIN_EXAMPLE
        $ ln -s /path/to/your/alphaCaml/directory/ alphaLib
        $ cat _tags
        "alphaLib": include, precious
      #+END_EXAMPLE

      It's very nice to make the whole directory precious, this is a
      way to mix different building units.

