toolchain/ocamlbuild.html
<li id="sec-1-12-2-1">OCamlbuild in the toplevel<br/>




<pre class="src src-caml"><span style="color: #bfebbf;">#</span>directory <span style="color: #cc9393;">"+ocamlbuild"</span>;;
<span style="color: #bfebbf;">#</span>load <span style="color: #cc9393;">"unix.cma"</span>;;
<span style="color: #bfebbf;">#</span>load <span style="color: #cc9393;">"ocamlbuildlib.cma"</span>;;
<span style="color: #dfaf8f;">open</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>;;
</pre>


<p>
     Now you can do a lot of amazing things in the toplevel and write
     complex plugin system.
</p>

<p>
     We can play toplevel here
</p>





<pre class="src src-caml">rule;;
- : string <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?tags:</span>string list <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?prods:</span>string list <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?deps:</span>string list <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?prod:</span>string <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?dep:</span>string <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?stamp:</span>string <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #dfaf8f;">?insert:</span>[ `after <span style="color: #8cd0d3;">of</span> string <span style="color: #bfebbf;">|</span> `before <span style="color: #8cd0d3;">of</span> string <span style="color: #bfebbf;">|</span> `bottom <span style="color: #bfebbf;">|</span> `top ] <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.action <span style="color: #bfebbf;">-&gt;</span> unit
= &lt;<span style="color: #8cd0d3;">fun</span>&gt;
<span style="color: #bfebbf;">#</span> tags_of_pathname;;
- : <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Pathname</span>.t <span style="color: #bfebbf;">-&gt;</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Tags</span>.t = &lt;<span style="color: #8cd0d3;">fun</span>&gt;
<span style="color: #bfebbf;">#</span> tag_file;;
- : <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Pathname</span>.t <span style="color: #bfebbf;">-&gt;</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Tags</span>.elt list <span style="color: #bfebbf;">-&gt;</span> unit =
&lt;<span style="color: #8cd0d3;">fun</span>&gt;
<span style="color: #bfebbf;">#</span> flag;;
- : <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Tags</span>.elt list <span style="color: #bfebbf;">-&gt;</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Command</span>.spec <span style="color: #bfebbf;">-&gt;</span> unit
= &lt;<span style="color: #8cd0d3;">fun</span>&gt;
<span style="color: #bfebbf;">#</span> dep;;
- : <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Tags</span>.elt list <span style="color: #bfebbf;">-&gt;</span>
    <span style="color: #8cd0d3;">Ocamlbuild_plugin</span>.<span style="color: #8cd0d3;">Pathname</span>.t list <span style="color: #bfebbf;">-&gt;</span> unit
= &lt;<span style="color: #8cd0d3;">fun</span>&gt;
</pre>


<p>
     The first argument is the name of the rule(uniqueness required),
     <code>~dep</code> is the dependency, <code>~prod</code> is the production.
</p>
<p>
     For example with rule
</p>


<pre class="example">~dep:"%.ml" ~prod:"%.byte" 
</pre>

<p>
     You can produce bla.byte from bal.ml
</p>
<p>
     There are some predefined commands such as Unix
     commands(cp,mv,&hellip;) as well.
     The sample code is a built-in rule in myocamlbuild source tree
</p>




<pre class="src src-caml">flag [<span style="color: #cc9393;">"ocaml"</span>; <span style="color: #cc9393;">"compile"</span>; <span style="color: #cc9393;">"thread"</span>] (<span style="color: #8cd0d3;">A</span> <span style="color: #cc9393;">"-thread"</span>)  
</pre>


<p>
     It says when tags <i>ocaml, compile, thread</i> are met together,
     <i>-thread</i> option should be emitted.
</p>
<p>
     You can go through the source code and read
</p>




<pre class="src src-caml"><span style="color: #8cd0d3;">let</span> flag tags flags = set_flags (<span style="color: #8cd0d3;">Tags</span>.of_list tags) flags
<span style="color: #8cd0d3;">let</span> dep tags deps = set_deps_of_tags (<span style="color: #8cd0d3;">Tags</span>.of_list tags) deps  
</pre>



<p>
     You can digger further and will find that <code>Tags.t</code> is actually
     <code>Set.Make(String).t</code>, but exported as an abstract type.
</p>
<p>
     <a href="http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Command.html">Command</a> module provides a bunch of useful API as well.
</p>
<p>
     Options contains mutable references to be configured
</p></li>
</ul>
<ul>
<li id="sec-1-12-2-2">Plugin Examples<br/>
<ul>
<li id="sec-1-12-2-2-1">AlphaCaml<br/>



<pre class="src src-tuareg"><span class="linenr"> 1:  </span><span style="color: #ff7f00; font-weight: bold;">open</span> <span style="color: #8cd0d3;">Ocamlbuild_plugin</span><span style="color: #eadd83;">;;</span>
<span class="linenr"> 2:  </span><span style="color: #ff7f00; font-weight: bold;">open</span> <span style="color: #8cd0d3;">Command</span><span style="color: #eadd83;">;;</span>
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span><span style="color: #ff7f00; font-weight: bold;">let</span> <span style="color: #dfaf8f;">alphaCaml </span><span style="color: #eadd83;">=</span> A<span style="color: #cc9393;">"alphaCaml"</span><span style="color: #eadd83;">;;</span>
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>dispatch <span style="color: #ff7f00; font-weight: bold;">begin</span> <span style="color: #f0dfaf; font-weight: bold;">function</span>
<span class="linenr"> 7:  </span> <span style="color: #dfaf8f;"> </span><span style="color: #eadd83;">|</span> After_rules <span style="color: #eadd83;">-&gt;</span>
<span class="linenr"> 8:  </span>      rule <span style="color: #cc9393;">"alphaCaml: mla -&gt; ml &amp; mli"</span>
<span class="linenr"> 9:  </span>        <span style="color: #eadd83;">~</span><span style="color: #dfaf8f;">prods</span><span style="color: #eadd83;">:[</span><span style="color: #cc9393;">"%.ml"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"%.mli"</span><span style="color: #eadd83;">]</span>
<span class="linenr">10:  </span>        <span style="color: #eadd83;">~</span><span style="color: #dfaf8f;">dep</span><span style="color: #eadd83;">:</span><span style="color: #cc9393;">"%.mla"</span>
<span class="linenr">11:  </span>        <span style="color: #ff7f00; font-weight: bold;">begin</span> <span style="color: #f0dfaf; font-weight: bold;">fun</span> <span style="color: #dfaf8f;">env _build </span><span style="color: #eadd83;">-&gt;</span>
<span class="linenr">12:  </span>          Cmd<span style="color: #eadd83;">(</span>S<span style="color: #eadd83;">[</span>alphaCaml<span style="color: #eadd83;">;</span> P<span style="color: #eadd83;">(</span>env <span style="color: #cc9393;">"%.mla"</span><span style="color: #eadd83;">)])</span>
<span class="linenr">13:  </span>        <span style="color: #ff7f00; font-weight: bold;">end</span>
<span class="linenr">14:  </span>  <span style="color: #eadd83;">|</span> _ <span style="color: #eadd83;">-&gt;</span> <span style="color: #eadd83;">()</span>
<span class="linenr">15:  </span><span style="color: #ff7f00; font-weight: bold;">end</span>
</pre>



<p>
      Here we show how to use rule in line [8-13], it means when
      you want to build <i>ml,mli</i> files, it will try to build it from
      <i>mla</i> first.
</p>
<p>
      To make it complete, for alphaCaml, you need some c stubs,
</p>



<pre class="example">$ ln -s /path/to/your/alphaCaml/directory/ alphaLib
$ cat _tags
"alphaLib": include, precious
</pre>


<p>
      It's very nice to make the whole directory precious, this is a
      way to mix different building units.
</p>
</li>
</ul>
<ul>
