toolchain/ocamlbuild.tex

\item OCamlbuild in the toplevel\\
\label{sec-1-12-2-1}%
\begin{minted}[]{ocaml}
#directory "+ocamlbuild";;
#load "unix.cma";;
#load "ocamlbuildlib.cma";;
open Ocamlbuild_plugin;;
\end{minted}

     Now you can do a lot of amazing things in the toplevel and write
     complex plugin system.


     We can play toplevel here




\begin{minted}[]{ocaml}
rule;;
- : string ->
    ?tags:string list ->
    ?prods:string list ->
    ?deps:string list ->
    ?prod:string ->
    ?dep:string ->
    ?stamp:string ->
    ?insert:[ `after of string | `before of string | `bottom | `top ] ->
    Ocamlbuild_plugin.action -> unit
= <fun>
# tags_of_pathname;;
- : Ocamlbuild_plugin.Pathname.t -> Ocamlbuild_plugin.Tags.t = <fun>
# tag_file;;
- : Ocamlbuild_plugin.Pathname.t -> Ocamlbuild_plugin.Tags.elt list -> unit =
<fun>
# flag;;
- : Ocamlbuild_plugin.Tags.elt list -> Ocamlbuild_plugin.Command.spec -> unit
= <fun>
# dep;;
- : Ocamlbuild_plugin.Tags.elt list ->
    Ocamlbuild_plugin.Pathname.t list -> unit
= <fun>
\end{minted}

     The first argument is the name of the rule(uniqueness required),
     \texttt{\textasciitilde{}dep} is the dependency, \texttt{\textasciitilde{}prod} is the production.

     For example with rule

\begin{verbatim}
~dep:"%.ml" ~prod:"%.byte"
\end{verbatim}
     You can produce bla.byte from bal.ml

     There are some predefined commands such as Unix
     commands(cp,mv,\ldots{}) as well.
     The sample code is a built-in rule in myocamlbuild source tree



\begin{minted}[]{ocaml}
flag ["ocaml"; "compile"; "thread"] (A "-thread")
\end{minted}

     It says when tags \emph{ocaml, compile, thread} are met together,
     \emph{-thread} option should be emitted.

     You can go through the source code and read



\begin{minted}[]{ocaml}
let flag tags flags = set_flags (Tags.of_list tags) flags
let dep tags deps = set_deps_of_tags (Tags.of_list tags) deps
\end{minted}


     You can digger further and will find that \texttt{Tags.t} is actually
     \texttt{Set.Make(String).t}, but exported as an abstract type.

     \href{http://www.seas.upenn.edu/~hongboz/hongbo_zhang_files/ob/Command.html}{Command} module provides a bunch of useful API as well.

     Options contains mutable references to be configured

\item Plugin Examples
\label{sec-1-12-2-2}%
\begin{itemize}

\item AlphaCaml\\
\label{sec-1-12-2-2-1}%
\begin{minted}[]{tuareg}
 1:  open Ocamlbuild_plugin;;
 2:  open Command;;
 3:  
 4:  let alphaCaml = A"alphaCaml";;
 5:  
 6:  dispatch begin function
 7:    | After_rules ->
 8:        rule "alphaCaml: mla -> ml & mli"
 9:          ~prods:["%.ml"; "%.mli"]
10:          ~dep:"%.mla"
11:          begin fun env _build ->
12:            Cmd(S[alphaCaml; P(env "%.mla")])
13:          end
14:    | _ -> ()
15:  end
\end{minted}


      Here we show how to use rule in line [8-13], it means when
      you want to build \emph{ml,mli} files, it will try to build it from
      \emph{mla} first.

      To make it complete, for alphaCaml, you need some c stubs,


\begin{verbatim}
$ ln -s /path/to/your/alphaCaml/directory/ alphaLib
$ cat _tags
"alphaLib": include, precious
\end{verbatim}

      It's very nice to make the whole directory precious, this is a
      way to mix different building units.
