toolchain/ocamlbuild.org
**** Driver
     #+BEGIN_SRC tuareg -n -r 
       let mk_local t tag =
         let name = tag /*> t in  
         let use_tag = "use_"^name in  ((function ()-> begin
           flag ["ocaml";"pp"; use_tag] (A name);
           dep ["ocamldep"; use_tag] [name];
           Log.dprintf 2  "create tag :%s" use_tag;
         end), use_tag)
       
         (**
            stolen from ocamlbuild source p4_flags can not be applied twice.
            it's already applied in [ocaml_specific.ml]
         *)    
       let p4_flags  = List.iter (fun p4 -> flag ["ocaml"; "pp"; p4] (A p4))
       
       let p4_flags' = List.iter (fun (p4, flags) -> flag ["ocaml"; "pp"; p4] flags)
       
     #+END_SRC

     #+BEGIN_SRC tuareg -n -r 
       (** calculate the pp flag and inject [-printer printer -o output]
          for pretty printing, it's pretty general *)
       let camlp4 ?(default = A "camlp4o.opt") ?(printer=A "r")
           tag i o env build = (
         let ml = env i and pp_ml = env o in
           (**  add a pp here to triger the rule pp,
                camlp4rf ==> camlp4rf  don't tag file pp,camlp4rf, it will be inherited by
                .cmo file, and cause trouble there  *)
         let tags = (((tags_of_pathname ml) ++ "ocaml" ++ "pp") ) ++ tag in
           (*
            * add a ocamldep here to trigger the rule
            *     ocamldep, use_geneq => examples/geneq.cma
            *     Rule.build_deps_of_tags will try to build the deps  *)
         let _deps = Rule.build_deps_of_tags build (tags ++ "ocamldep") in
         let pp = Command.reduce (Flags.of_tags tags) in
         let pp = match pp with | N -> default | _ -> pp in
         Cmd (S [ pp; P ml; A "-printer";printer; A "-o"; Px pp_ml ])
       )
       
       (**
          Get the output from the error channel
       ,*)  
       let infer_with_error_channel ?(ocamlc=Options.ocamlc) flag tag =
         let infer ml dlambda env build =
           let open Ocaml_utils in
           let ml = env ml and dlambda = env dlambda in
           let tags = tags_of_pathname ml ++ "ocaml" in
           Ocaml_compiler.prepare_compile build ml ;
           Cmd(S[!ocamlc; ocaml_ppflags tags; ocaml_include_flags ml;
                 A flag;
                 (if Tags.mem "thread" tags then A"-thread" else N);
                 T(tags++tag); P ml; Sh"2>"; Px dlambda]) in
         infer 
       let infer_dlambda =  infer_with_error_channel "-dlambda" "infer_dlambda"
       let infer_drawlambda = infer_with_error_channel "-drawlambda" "infer_drawlambda"
       let infer_dparsetree = infer_with_error_channel "-dparsetree" "infer_dparsetree"
       let infer_instr =  infer_with_error_channel "-dinstr" "infer_instr"
       let infer_dclambda =  infer_with_error_channel
         ~ocamlc:Options.ocamlopt "-dclambda" "infer_dclambda"
       let infer_dcmm = infer_with_error_channel
         ~ocamlc:Options.ocamlopt "-dcmm" "infer_dcmm" 
       let infer_dlinear = infer_with_error_channel
         ~ocamlc:Options.ocamlopt "-dlinear" "infer_dlinear";;

     #+END_SRC

     #+BEGIN_SRC tuareg -n -r 
       let mk_odocl _ _ =
         let modules = String.concat "\n" (StringSet.elements !Options.doc_modules) in
         Cmd (S[A"echo"; Quote(Sh modules); Sh">";
                P ("foo" /*> Odocl)])
         (* generate files for .mllib .mldylib .itarget *)    
       let mk_files file lst env build =
         let lst = String.concat "\n" lst  in
         Cmd (S[A"echo"; Quote(Sh lst); Sh ">"; P file ])
       
       let mk_lib tbl suffix env build =
         let m = env "%" in 
         let lst =
           try  Hashtbl.find tbl  m
           with Not_found -> begin
             Log.dprintf 2
               "Warning: %s not defined in table, using default  rule" m;
             raise Rule.Failed
           end in
         mk_files (m/*>suffix) lst env build
       let mk_mllib = mk_lib Options.lib_files Mllib
       let mk_mldylib = mk_lib Options.lib_files Mldylib
       let mk_itarget = mk_lib Options.target_files Itarget
       let mk_version _ _ = (
         let cmd =
           sprintf "let version = %S\n\
       let compile_time = %S" 
             Options.version Options.time in
         Cmd (S[A"echo"; Quote (Sh cmd); Sh ">"; P"version.ml"]))
     #+END_SRC
     
**** Rules

     #+BEGIN_SRC tuareg -n -r 
       rule "preprocess: ml -> _ppr.ml" ~dep: "%.ml" ~prod:"%_ppr.ml"
        (camlp4 "%_ppr.ml" "%.ml" "%_ppr.ml");
       rule "preprocess: ml -> _ppo.ml" ~dep: "%.ml" ~prod: "%_ppo.ml"
        (camlp4 ~printer:(A"o") "%_ppo.ml" "%.ml" "%_ppo.ml");
     #+END_SRC
** Mixing with C stubs

   Here's a very stupid way of building c stubs: tag your c code
   precious, then mv it into =_build= directory. Then link it by hand.


   #+BEGIN_EXAMPLE
     _tags:
     <single_write.o> : precious
     
     Makefile:
     _build/single_write.o: single_write.o
             test -d $(LIB) || mkdir $(LIB)
             cp single_write.o $(LIB)
     # tag single_write.o precious
     write.cma:  _build/single_write.o write.cmo
             cd $(LIB); ocamlc -custom -a -o single_write.o write.cmo
          
   #+END_EXAMPLE
*** Built in support
    There's built in support, solution is:


    #+BEGIN_SRC tuareg
    dep ["link"; "ocaml"; "use_plus_stubs"] ["plus_stubs.o"];
    flag["link"; "ocaml"; "byte"] (S[A"-custom"]);
    #+END_SRC

    OCamlbuild can invoke =gcc= to do the building process. The tags file is
    like this


    #+BEGIN_EXAMPLE
    <plus.{byte,native}> : use_plus_stubs  
    #+END_EXAMPLE


    Notice that =-custom= is only for =byte= link, native link
    will link it by default. You can also *enrich your runtime*
    without linking to each byte file everytime.

    It's convenient for example when you using llvm, you don't need to
    link into it each time.

    #+CAPTION: Making a new runtime
    #+BEGIN_EXAMPLE
    ocamlc -make-runtime -o new_ocamlrun progc.o a_c_library.a
    ocamlc -o vbcname.exe -use-runtime new_ocamlrun progocaml.cmo
    #+END_EXAMPLE


    Instead of new runtime, you can also build a toplevlel linking c
    functions

    #+CAPTION: Making a new toplevel
    #+BEGIN_EXAMPLE
      ocamlmktop -custom -o ftop progc.o a_c_library.a ex.ml    
    #+END_EXAMPLE

    So you see, you have 4 choices, /enrich your runtime/, /toplevel/,
    /bytecode/, /native code/.

** Building cmi files
   /cmi/ file needs library path as well, when you introduce
   external dependency.

   #+BEGIN_EXAMPLE
     <ppo.{mli}> : use_camlp4   
   #+END_EXAMPLE

   Tag /cmi/ file *does not make sense* , tag /.mli/ file instead.
   The =_log= below is a sample output.

   #+BEGIN_EXAMPLE
     # Target: ppo.cmi, tags: { byte, compile, extension:mli, file:ppo.mli, interf, ocaml, quiet, traverse, use_camlp4 }
     ocamlfind ocamlc -annot -c -I +camlp4 -o ppo.cmi ppo.mli
   #+END_EXAMPLE
** Debugging
   Pass /-cflags -verbose/ and /-lflags -verbose/ to
   ocamlbuild, then read the log
