toolchain/ocamlbuild.html

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13">Mixing with C stubs</h3>
<div class="outline-text-3" id="text-1-13">


<p>
   Here's a very stupid way of building c stubs: tag your c code
   precious, then mv it into <code>_build</code> directory. Then link it by hand.
</p>




<pre class="example">_tags:
&lt;single_write.o&gt; : precious

Makefile:
_build/single_write.o: single_write.o
        test -d $(LIB) || mkdir $(LIB)
        cp single_write.o $(LIB)
# tag single_write.o precious
write.cma:  _build/single_write.o write.cmo
        cd $(LIB); ocamlc -custom -a -o single_write.o write.cmo
     
</pre>


</div>

<div id="outline-container-1-13-1" class="outline-4">
<h4 id="sec-1-13-1">Built in support</h4>
<div class="outline-text-4" id="text-1-13-1">

<p>    There's built in support, solution is:
</p>




<pre class="src src-tuareg">dep <span style="color: #eadd83;">[</span><span style="color: #cc9393;">"link"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"ocaml"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"use_plus_stubs"</span><span style="color: #eadd83;">]</span> <span style="color: #eadd83;">[</span><span style="color: #cc9393;">"plus_stubs.o"</span><span style="color: #eadd83;">];</span>
flag<span style="color: #eadd83;">[</span><span style="color: #cc9393;">"link"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"ocaml"</span><span style="color: #eadd83;">;</span> <span style="color: #cc9393;">"byte"</span><span style="color: #eadd83;">]</span> <span style="color: #eadd83;">(</span>S<span style="color: #eadd83;">[</span>A<span style="color: #cc9393;">"-custom"</span><span style="color: #eadd83;">]);</span>
</pre>


<p>
    OCamlbuild can invoke <code>gcc</code> to do the building process. The tags file is
    like this
</p>




<pre class="example">&lt;plus.{byte,native}&gt; : use_plus_stubs  
</pre>



<p>
    Notice that <code>-custom</code> is only for <code>byte</code> link, native link
    will link it by default. You can also <b>enrich your runtime</b>
    without linking to each byte file everytime.
</p>
<p>
    It's convenient for example when you using llvm, you don't need to
    link into it each time.
</p>



<pre class="example">ocamlc -make-runtime -o new_ocamlrun progc.o a_c_library.a
ocamlc -o vbcname.exe -use-runtime new_ocamlrun progocaml.cmo
</pre>



<p>
    Instead of new runtime, you can also build a toplevlel linking c
    functions
</p>



<pre class="example">ocamlmktop -custom -o ftop progc.o a_c_library.a ex.ml    
</pre>


<p>
    So you see, you have 4 choices, <i>enrich your runtime</i>, <i>toplevel</i>,
    <i>bytecode</i>, <i>native code</i>.
</p>
</div>
</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14">Building cmi files</h3>
<div class="outline-text-3" id="text-1-14">

<p>   <i>cmi</i> file needs library path as well, when you introduce
   external dependency.
</p>



<pre class="example">&lt;ppo.{mli}&gt; : use_camlp4   
</pre>


<p>
   Tag <i>cmi</i> file <b>does not make sense</b> , tag <i>.mli</i> file instead.
   The <code>_log</code> below is a sample output.
</p>



<pre class="example"># Target: ppo.cmi, tags: { byte, compile, extension:mli, file:ppo.mli, interf, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamlc -annot -c -I +camlp4 -o ppo.cmi ppo.mli
</pre>

</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15">Debugging</h3>
<div class="outline-text-3" id="text-1-15">

<p>   Pass <i>-cflags -verbose</i> and <i>-lflags -verbose</i> to
   ocamlbuild, then read the log
</p></div>
</div>
</div>
</div>

<div id="postamble">
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
