toolchain/ocamlbuild.tex
\subsection*{Mixing with C stubs}
\label{sec-1-13}


   Here's a very stupid way of building c stubs: tag your c code
   precious, then mv it into \texttt{\_build} directory. Then link it by hand.



\begin{verbatim}
_tags:
<single_write.o> : precious

Makefile:
_build/single_write.o: single_write.o
        test -d $(LIB) || mkdir $(LIB)
        cp single_write.o $(LIB)
# tag single_write.o precious
write.cma:  _build/single_write.o write.cmo
        cd $(LIB); ocamlc -custom -a -o single_write.o write.cmo
\end{verbatim}
\subsubsection*{Built in support}
\label{sec-1-13-1}

    There's built in support, solution is:



\begin{minted}[]{tuareg}
dep ["link"; "ocaml"; "use_plus_stubs"] ["plus_stubs.o"];
flag["link"; "ocaml"; "byte"] (S[A"-custom"]);
\end{minted}

    OCamlbuild can invoke \texttt{gcc} to do the building process. The tags file is
    like this



\begin{verbatim}
<plus.{byte,native}> : use_plus_stubs
\end{verbatim}


    Notice that \texttt{-custom} is only for \texttt{byte} link, native link
    will link it by default. You can also \textbf{enrich your runtime}
    without linking to each byte file everytime.

    It's convenient for example when you using llvm, you don't need to
    link into it each time.


\begin{verbatim}
ocamlc -make-runtime -o new_ocamlrun progc.o a_c_library.a
ocamlc -o vbcname.exe -use-runtime new_ocamlrun progocaml.cmo
\end{verbatim}


    Instead of new runtime, you can also build a toplevlel linking c
    functions


\begin{verbatim}
ocamlmktop -custom -o ftop progc.o a_c_library.a ex.ml
\end{verbatim}

    So you see, you have 4 choices, \emph{enrich your runtime}, \emph{toplevel},
    \emph{bytecode}, \emph{native code}.
\subsection*{Building cmi files}
\label{sec-1-14}

   \emph{cmi} file needs library path as well, when you introduce
   external dependency.


\begin{verbatim}
<ppo.{mli}> : use_camlp4
\end{verbatim}

   Tag \emph{cmi} file \textbf{does not make sense} , tag \emph{.mli} file instead.
   The \texttt{\_log} below is a sample output.


\begin{verbatim}
# Target: ppo.cmi, tags: { byte, compile, extension:mli, file:ppo.mli, interf, ocaml, quiet, traverse, use_camlp4 }
ocamlfind ocamlc -annot -c -I +camlp4 -o ppo.cmi ppo.mli
\end{verbatim}
\subsection*{Debugging}
\label{sec-1-15}

   Pass \emph{-cflags -verbose} and \emph{-lflags -verbose} to
   ocamlbuild, then read the log

\end{document}